{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/patrickpoleshuk/FDI FINAL TIME .smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Nov 2020, 16:13:51

{com}. *In my research assignment, I am interested in how Gross Domestic Product (GDP), among other control variables, affects inflows of Foreign Direct Investment (FDI) which externally pour into a country. Specifically, I used the 33 countries that are considered to be in the region of Latin America, coupled with the 4 largest populated dependencies that are situated in the region, such as Puerto Rico, Guadeloupe, Martinique, and French Guiana; in total that should be 37 countries. However, I also included the United States as I feel that there's a relatively large amount of data on the country and it would greatly aid my data analysis in the case where I lack observational values. Given my 38 countries, I wanted to know how FDI, denominated in USD, changes with an alteration in GDP among many other variables including, but not limited to, life expectancy, schooling, access to electricity within the infrastructure, fluctuations within exchange rates, and degree of inclusive market institutions within a particular country. Conceptually, I would predict that as a nation's economy grows significantly or even if it manages to grow at all, presumably over a series of years and not all of a sudden out from a recessionary state, that foreign investors would be more willing to invest in the country. As some background, GDP is used to examine how large an economy is, and it can roughly be translated as the total national income produced within the borders of a given country. If we assume that supply produces demand, then if a country’s citizens produce more goods, as indicated by a higher monetary value, then they can use that income they get from supplying these goods to demand other goods. In other words, if we assume a given country’s population doesn’t rise faster than the GDP growth rate, we can say that the country’s inhabitants are able to supply and demand more goods and services in the economy than they would before. Overall, using data from the aforementioned 38 countries, I wanted to examine the effect that a large economy has on foreign investors willingness to invest in a given country. 

. *In recent years developing nations are acquiring a lot of attention, seemingly more so than ever before, for the pace that their economies are growing at. Contrary to great pessimism in the western world about future career prospects and purchasing power, as advancements in productivity have not been able to significantly overcome contemporary stagnant wages and all the while jobs are being outsourced overseas for specific sectors of the economy, the youth in developing countries are becoming more optimistic that they will have a higher standard of living than their parents ever did (Pew Global Attitudes Survey, 2014). The standard of living for the global population, in terms of decreasing global violence, warfare lethality, extreme poverty, world hunger rates, infant mortality rates, and booming literacy rates, has never been seen before (Proof that Life is Getting Better for Humanity, in 5 Charts, 2016). Personally, I attribute a lot of this success to growing inclusive market institutions in formerly underdeveloped nations, as they are able to untap the potential in price-coordinated markets unseen by much of the world’s population. Given this contemporary phenomenon, I find foreign investor confidence in these growing markets to be especially interesting. Aside from being initially interested in the region of Latin America, I chose this sum of countries due to their developing status. Given that we’ve seen many of these countries growing in size, it would be interesting to verify how greatly a change in GDP is associated with an increase or decrease in FDI; looking into the future, a growing economy that attracts foreign investment confidence may make future economic growth consistently more sustainable. 

. *Given that World Bank data is collected through national statistical agencies and various inter-governmental organizations, including the UN and WHO, we can assume that there is minimal measurement error in our data. I would definitely classify it as a reliable source, with minimal exogenous biases in reporting. After importing the World Bank data for FDI and GDP, which stretched from the years 1960-2018, I was able to begin creating a for loop for both of them to display the FDI and GDP values back-to-back, organized by “countryname” and “year”. This encompassed the majority of my cleaning process. Furthermore, I added 14 other control variables, which will tend to diminish as we go further into controlling for endogeneity biases in my regression analysis. There are many factors that would affect foreign confidence and investment into a country besides a growing enrichment of its people; this would include existing robust infrastructure, health and educational status, political stability, and existing relative exchange rates which would affect rate of return on investment among many other things. I also chose to control for homicide rates, as I believe homicide rates are very relevant in discussions on Latin America, especially for countries such as El Salvador, Hondorus, and Venezuela. In any case, I had to create other loops for all of this imported data. We can also see that for all the below loops, I had to drop extraneous columns of data and had to merge each data frame created from the loop structure. Additionally, I reshaped my data from a wide to long format, so that I could view “countryname” and “year” all on the same page along with their various data points just by scrolling down. All my data sets merged perfectly, 1:1, where they all shared the same “countryname” and “year” categorization. Lastly, after merging my data sets, I dropped the merge variable as it was no longer needed. 

. 
. import delimited "/Users/patrickpoleshuk/Downloads/API_IC.LGL.CRED.XQ_DS2_en_csv_v2_1563361/API_IC.LGL.CRED.XQ_DS2_en_csv_v2_1563361.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' LEGAL`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Here is a variable for the "Strength of the Legal Rights Index" (from 0-12, where 0 signfies the weakest legal institutions and 12 signfies a country has the strongest possible legal institutions in a given year).

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long LEGAL, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
      {res}LEGAL1960 LEGAL1961 ... LEGAL2019   {txt}->   {res}LEGAL
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/LEGAL.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/LEGAL.dta saved

{com}. 
. 
. *-----

. import delimited "/Users/patrickpoleshuk/Downloads/API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_1565012/API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_1565012.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' ELEC`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * The variable ELEC controls for "Electric Power Consumption (kWh per capita)", which could be a proxy for industrialized growth. We can hypothesis, then, that the coefficent effect of ELEC will have a positive effect on the FDI going into a given country. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long ELEC, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}ELEC1960 ELEC1961 ... ELEC2019   {txt}->   {res}ELEC
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/ELEC.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/ELEC.dta saved

{com}. 
. *-----

. import delimited "/Users/patrickpoleshuk/Downloads/API_GC.DOD.TOTL.GD.ZS_DS2_en_csv_v2_1566293/API_GC.DOD.TOTL.GD.ZS_DS2_en_csv_v2_1566293.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' DEBT`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Here I'm controlling for "Central Government Debt" as a total % of a country's GDP. I would predict that this variable has a negative impact on FDI, but I believe this depends on the nature of the debt. If a higher debt to GDP ratio is the result of funding warfare activities, then I believe this will have a negative impact on FDI. However, if, for example, a country is undergoing expansionary fiscal or monetary policy to offset minor economic setbacks, FDI may be unchanged. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long DEBT, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}DEBT1960 DEBT1961 ... DEBT2019   {txt}->   {res}DEBT
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/DEBT.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/DEBT.dta saved

{com}. 
. *------

. import delimited "/Users/patrickpoleshuk/Downloads/API_SE.PRM.NENR_DS2_en_csv_v2_1565149/API_SE.PRM.NENR_DS2_en_csv_v2_1565149.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' SCHOOL`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * The variable SCHOOL measures primary school enrollment as a net % of the population. Education is an integral part of calculating the Human Development Index (HDI), so I would predict that a higher % enrollment in primary school would correspond with higher FDI inflows. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long SCHOOL, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
   {res}SCHOOL1960 SCHOOL1961 ... SCHOOL2019   {txt}->   {res}SCHOOL
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/SCHOOL.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/SCHOOL.dta saved

{com}. 
. *------

. import delimited "/Users/patrickpoleshuk/Downloads/API_SH.DYN.MORT_DS2_en_csv_v2_1499522/API_SH.DYN.MORT_DS2_en_csv_v2_1499522.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' MORT`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Similar to the variable below, I am attempting to control for the health of a given country. The variable MORT measures the infant mortality rates, per 1,000 births, where an "infant" is classified as any child under 5 years of age. A lower infant mortality rate should correspond to a higher FDI, but I may run into issues with multicollinearity as the variable of LIFE may be correlated with this variable. 

. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long MORT, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}MORT1960 MORT1961 ... MORT2019   {txt}->   {res}MORT
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/MORT.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/MORT.dta saved

{com}. 
. *------

. import delimited "/Users/patrickpoleshuk/Downloads/API_SP.DYN.LE00.IN_DS2_en_csv_v2_1495206/API_SP.DYN.LE00.IN_DS2_en_csv_v2_1495206.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' LIFE`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Given that a country's general health is a strong indicator of its economic development, I included a variable which measures "Life Expectancy At Birth" (in years.). As the people are becoming healthier, foreign investment optimism may increase. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long LIFE, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}LIFE1960 LIFE1961 ... LIFE2019   {txt}->   {res}LIFE
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/LIFE.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/LIFE.dta saved

{com}. 
. *------

. import delimited "/Users/patrickpoleshuk/Downloads/API_SI.POV.GINI_DS2_en_csv_v2_1495229/API_SI.POV.GINI_DS2_en_csv_v2_1495229.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' GINI`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * GINI stands for the Gini Index (or coefficent), as estimated by the World Bank. Simply put, it is a measure of inequality of income within a country. If the GINI variable is 0, there is perfect equality of income, and if there exists perfect inequality, the GINI variable would be 1 (100% here given that they spread the index out from 0% to 100% in this dataset). Both of these cases are pragmatically impossible, so it realistically is going to be dispersed around 50%. Personally, I believe that a higher GINI coefficent can both be good and bad for FDI inflows. A higher Gini index, while indicating higher inequality, could signal that that the country has adopted more inclusive market institutions, which take advantage of the entrepreneurial talents of the people, and thus a higher percentage of the country's wealth is concentrated within these successful groups of entrepreneurs. On the other hand, it could be a harbinger for political elite corruption, where some variety of extractive market institutions are in play to perpetuate the wealth of a ruling class. Thus, it is hard to say what the effect will be on FDI in either case. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long GINI, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}GINI1960 GINI1961 ... GINI2019   {txt}->   {res}GINI
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/GINI.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/GINI.dta saved

{com}. sum GINI

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}GINI {c |}{res}      1,709    107.2032    359.2856       20.7       2019

{com}. 
. *-------

. 
. import delimited "/Users/patrickpoleshuk/Downloads/API_BX.KLT.DINV.CD.WD_DS2_en_csv_v2_1495714 2/API_BX.KLT.DINV.CD.WD_DS2_en_csv_v2_1495714.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' FDI`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Foreign direct investment is any investment made by a firm or individual in one country into business interests located in another country. In this dataset it is denominated in USD, and will serve as the dependent variable all future regression analysis.

. 
. rename v1 countryname
{res}
{com}. drop v65 v66 v3 v4 v2

. reshape long FDI, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)
FDI1974:  {res}69{txt} values would be changed; not changed
FDI1975:  {res}89{txt} values would be changed; not changed
FDI1976:  {res}94{txt} values would be changed; not changed
FDI1977:  {res}104{txt} values would be changed; not changed
FDI1978:  {res}107{txt} values would be changed; not changed
FDI1979:  {res}102{txt} values would be changed; not changed
FDI1980:  {res}108{txt} values would be changed; not changed
FDI1981:  {res}106{txt} values would be changed; not changed
FDI1982:  {res}107{txt} values would be changed; not changed
FDI1983:  {res}109{txt} values would be changed; not changed
FDI1984:  {res}108{txt} values would be changed; not changed
FDI1985:  {res}113{txt} values would be changed; not changed
FDI1986:  {res}119{txt} values would be changed; not changed
FDI1987:  {res}126{txt} values would be changed; not changed
FDI1988:  {res}125{txt} values would be changed; not changed
FDI1989:  {res}128{txt} values would be changed; not changed
FDI1990:  {res}131{txt} values would be changed; not changed
FDI1991:  {res}138{txt} values would be changed; not changed
FDI1992:  {res}143{txt} values would be changed; not changed
FDI1993:  {res}150{txt} values would be changed; not changed
FDI1994:  {res}154{txt} values would be changed; not changed
FDI1995:  {res}160{txt} values would be changed; not changed
FDI1996:  {res}159{txt} values would be changed; not changed
FDI1997:  {res}165{txt} values would be changed; not changed
FDI1998:  {res}174{txt} values would be changed; not changed
FDI1999:  {res}173{txt} values would be changed; not changed
FDI2000:  {res}181{txt} values would be changed; not changed
FDI2001:  {res}187{txt} values would be changed; not changed
FDI2002:  {res}190{txt} values would be changed; not changed
FDI2003:  {res}192{txt} values would be changed; not changed
FDI2004:  {res}203{txt} values would be changed; not changed
FDI2005:  {res}200{txt} values would be changed; not changed
FDI2006:  {res}214{txt} values would be changed; not changed
FDI2007:  {res}220{txt} values would be changed; not changed
FDI2008:  {res}225{txt} values would be changed; not changed
FDI2009:  {res}217{txt} values would be changed; not changed
FDI2010:  {res}222{txt} values would be changed; not changed
FDI2011:  {res}230{txt} values would be changed; not changed
FDI2012:  {res}230{txt} values would be changed; not changed
FDI2013:  {res}234{txt} values would be changed; not changed
FDI2014:  {res}230{txt} values would be changed; not changed
FDI2015:  {res}227{txt} values would be changed; not changed
FDI2016:  {res}227{txt} values would be changed; not changed
FDI2017:  {res}232{txt} values would be changed; not changed
FDI2018:  {res}234{txt} values would be changed; not changed
FDI2019:  {res}226{txt} values would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
            {res}FDI1960 FDI1961 ... FDI2019   {txt}->   {res}FDI
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/FDI.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/FDI.dta saved

{com}. 
. *-------

. 
. import delimited "/Users/patrickpoleshuk/Desktop/API_SI.POV.DDAY_DS2_en_csv_v2_889325.csv", encoding(UTF-8) clear 
{res}{text}(65 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' POVERTY`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * POVERTY is the "Poverty Headcount Ratio At $1.90 A Day (2011 PPP) (% of population)". This is currently the indicator that one is living in extreme poverty, and we can certainly predict that the more impoverished a country is at baseline, the less optimistic foreign investors will be in realizing the rapidity of that country's growth prospects. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long POVERTY, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
{res}POVERTY1960 POVERTY1961 ... POVERTY2019   {txt}->   {res}POVERTY
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/POVERTY.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/POVERTY.dta saved

{com}. 
. *-------

. 
. import delimited "/Users/patrickpoleshuk/Desktop/API_EG.ELC.ACCS.ZS_DS2_en_csv_v2_889816.csv", encoding(UTF-8) clear 
{res}{text}(65 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' ENERGY`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * ENERGY is a variable I use to indicate how robust the infrastructure of a country is. It measures what percent of the total population has access to electricity, and we could assume that if the infrastructure grows stronger so will foreign investment into it. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long ENERGY, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
   {res}ENERGY1960 ENERGY1961 ... ENERGY2019   {txt}->   {res}ENERGY
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/ENERGY.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/ENERGY.dta saved

{com}. 
. *-------

. 
. import delimited "/Users/patrickpoleshuk/Desktop/API_SE.ADT.1524.LT.ZS_DS2_en_csv_v2_892176.csv", encoding(UTF-8) clear 
{res}{text}(65 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x' +1955
{txt}  3{com}. rename v`x' LITERACY`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * LITERACY is a variable that measures "Literacy Rate, Youth Total (% of people ages 15-24)". Although we may predict that there could be multicollinearity between this variable and SCHOOL, we could still predict, without conducting any analysis yet, that foreign investors would have more confidence investing their money in a country with a more educated populace. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long LITERACY, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
{res}LITERACY1960 LITERACY1961 ... LITERACY2019{txt}->   {res}LITERACY
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/LITERACY.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/LITERACY.dta saved

{com}. 
. *-------

.  import delimited "/Users/patrickpoleshuk/Downloads/API_NY.GDP.MKTP.CD_DS2_en_csv_v2_1495053/API_NY.GDP.MKTP.CD_DS2_en_csv_v2_1495053.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x'+1955
{txt}  3{com}. rename v`x' GDP`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * GDP, to mention again, is the monetary value of all goods and services produced within a country in a specific time-frame (in this case it's every year).

. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long GDP, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      62   {txt}->{res}       4
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
            {res}GDP1960 GDP1961 ... GDP2019   {txt}->   {res}GDP
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/GDP.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/GDP.dta saved

{com}. 
. *--------

. 
. import delimited "/Users/patrickpoleshuk/Desktop/API_VC.IHR.PSRC.P5_DS2_en_csv_v2_422503.csv", clear 
{res}{text}(65 vars, 265 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x'+1955
{txt}  3{com}. rename v`x' CRIME`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * CRIME measures the Intentional Homicides rate (per 100,000 people). As mentioned above, this seems to be a growing trend within some countries in Latin America, and within larger cities in the U.S, so I wanted to test whether it had a signficant effect on a country's ability to affect FDI flows.

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long CRIME, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     265   {txt}->{res}   15900
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
      {res}CRIME1960 CRIME1961 ... CRIME2019   {txt}->   {res}CRIME
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/CRIME.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/CRIME.dta saved

{com}. 
. *--------

. 
. import delimited "/Users/patrickpoleshuk/Desktop/API_PA.NUS.FCRF_DS2_en_csv_v2_888121.csv", encoding(UTF-8) clear 
{res}{text}(65 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x'+1955
{txt}  3{com}. rename v`x' EXCHANGE`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * EXCHANGE measures the Official Exchange Rate (where it measures the total amount of local currency needed to purchase 1 USD), for the yearly average. You will later see that I will be converting this varibale into log format, as it would be much more useful to interpret a currency appreciating or depreciating against the USD by a given percent. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long EXCHANGE, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      61   {txt}->{res}       3
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
{res}EXCHANGE1960 EXCHANGE1961 ... EXCHANGE2019{txt}->   {res}EXCHANGE
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/EXCHANGE.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/EXCHANGE.dta saved

{com}. 
. *--------

. 
. import delimited "/Users/patrickpoleshuk/Downloads/API_IC.BUS.DFRN.XQ_DS2_en_csv_v2_1571281/API_IC.BUS.DFRN.XQ_DS2_en_csv_v2_1571281.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x'+1955
{txt}  3{com}. rename v`x' EASE`y'
{txt}  4{com}. {c )-}
{res}
{com}. * EASE is the measure of the "Ease of Doing Business Score (0 = lowest performance to 100 = best performance). Like the varibale LEGAL, this variable attemps to control for the degree of inclusive market institutions within a given country. LEGAL tries to account for strong tangible property rights, intellectual property rights, and fair judicial processes, among many other things, while EASE attempts to determine how business friendly a country is. For example, areas such as Peru, while developing rapidly, have fostered somewhat of a negative reputation as an area where legal businesses are seldom practiced. This is due to overwhelming amount of bribes and permits needed for one to operate legally in the country. This comes with drawbacks, however, given that their business is illegal they are unable to adquire capital to expand their operations; one can only go so far when operating an illegal business. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long EASE, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      62   {txt}->{res}       4
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
         {res}EASE1960 EASE1961 ... EASE2019   {txt}->   {res}EASE
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/EASE.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/EASE.dta saved

{com}. *--------

. 
. import delimited "/Users/patrickpoleshuk/Downloads/API_IC.TAX.TOTL.CP.ZS_DS2_en_csv_v2_1568104/API_IC.TAX.TOTL.CP.ZS_DS2_en_csv_v2_1568104.csv", encoding(UTF-8) clear 
{res}{text}(66 vars, 267 obs)

{com}. 
. forvalues x=5(1)64{c -(}
{txt}  2{com}. local y= `x'+1955
{txt}  3{com}. rename v`x' TAX`y'
{txt}  4{com}. {c )-}
{res}
{com}. 
. * Here is our last control variable, it is the "Total Tax And Contribution Rate" (as a % of total profit). Naturally, a tax is a disincentive on consumption and investment within and outside a country's borders. If larger portions of profit resulting from FDI are compromised with, as say a higher capital gains tax, then we can expect a negative coefficent effect of TAX on FDI. 

. 
. rename v1 countryname
{res}
{com}. drop v65 v3 v4 v2

. reshape long TAX, i(countryname) j(year)
{txt}(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     267   {txt}->{res}   16020
{txt}Number of variables            {res}      62   {txt}->{res}       4
{txt}j variable (60 values)                    ->   {res}year
{txt}xij variables:
            {res}TAX1960 TAX1961 ... TAX2019   {txt}->   {res}TAX
{txt}{hline 77}

{com}. sort countryname year

. save "/Users/patrickpoleshuk/Downloads/TAX.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/TAX.dta saved

{com}. 
. use "/Users/patrickpoleshuk/Downloads/FDI.dta", clear

. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/GDP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/DEBT.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/EASE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/TAX.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/LIFE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/SCHOOL.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          16,020{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(0 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/CRIME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             240
{txt}{col 9}from master{col 30}{res}             180{txt}  (_merge==1)
{col 9}from using{col 30}{res}              60{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(240 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/MORT.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/ENERGY.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/LEGAL.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/POVERTY.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/GINI.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/ELEC.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/LITERACY.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. merge 1:1 countryname year using "/Users/patrickpoleshuk/Downloads/EXCHANGE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             180{txt}  (_merge==2)

{col 5}matched{col 30}{res}          15,840{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge ==3
{txt}(180 observations deleted)

{com}. drop _merge 

. 
. keep if countryname == "Mexico" | countryname == "United States" | countryname=="Nicaragua" | countryname=="Guatemala" | countryname=="Venezuela" | countryname=="Chile" | countryname=="Brazil" | countryname==" Colombia"| countryname=="Argentina" | countryname=="Ecuador" | countryname=="Cuba" | countryname=="Bolivia" | countryname=="Haiti" | countryname=="Dominican Republic" | countryname=="Honduras" | countryname=="Paraguay" | countryname=="El Salvador" | countryname=="Costa Rica" | countryname=="Panama" | countryname=="Puerto Rico" | countryname=="Uruguay" | countryname=="Guadeloupe"| countryname=="Martinique" | countryname=="French Guiana" | countryname=="Saint Kitts and Nevis" | countryname=="Dominica" | countryname=="Antigua and Barbuda" | countryname=="Grenada" | countryname=="Saint Vincent and the Grenadines" | countryname=="Saint Lucia" | countryname=="Barbados" | countryname=="Trinidad and Tobago" | countryname=="Bahamas" | countryname=="Suriname" | countryname=="Guyana" | countryname=="Jamaica" | countryname=="Belize" | countryname=="Peru"
{txt}(14,100 observations deleted)

{com}. 
. save "/Users/patrickpoleshuk/Downloads/Final.dta", replace
{txt}file /Users/patrickpoleshuk/Downloads/Final.dta saved

{com}. 
. keep if year >= 1960
{txt}(0 observations deleted)

{com}. * I'll be keeping data from all years in the data frame, for the sake of perserving high statistically signficant variables. 

. drop if year >= 2019
{txt}(29 observations deleted)

{com}. * This is the highest year that data is currently collected at.

. 
. * ssc install asdoc

. * I will be using this package in the future to translate some of my regression tables and graphs into a word format. 

. 
. sum GDP, d

                             {txt}GDP
{hline 61}
      Percentiles      Smallest
 1%    {res} 7.15e+07       2.81e+07
{txt} 5%    {res} 2.41e+08       3.00e+07
{txt}10%    {res} 4.39e+08       3.19e+07       {txt}Obs         {res}      1,624
{txt}25%    {res} 1.25e+09       3.37e+07       {txt}Sum of Wgt. {res}      1,624

{txt}50%    {res} 6.57e+09                      {txt}Mean          {res} 3.24e+11
                        {txt}Largest       Std. Dev.     {res} 1.78e+12
{txt}75%    {res} 2.97e+10       1.82e+13
{txt}90%    {res} 2.09e+11       1.87e+13       {txt}Variance      {res} 3.17e+24
{txt}95%    {res} 8.62e+11       1.95e+13       {txt}Skewness      {res} 7.848828
{txt}99%    {res} 1.09e+13       2.05e+13       {txt}Kurtosis      {res} 69.39298

{com}. gen HIGDP = (GDP >  1.57e+10) 

. ttest FDI, by(HIGDP)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}    807{col 22} 1.25e+08{col 34}  8203333{col 46} 2.33e+08{col 58} 1.09e+08{col 70} 1.42e+08
       {txt}1 {c |}{res}{col 12}    478{col 22} 1.93e+10{col 34} 2.77e+09{col 46} 6.06e+10{col 58} 1.39e+10{col 70} 2.47e+10
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}  1,285{col 22} 7.26e+09{col 34} 1.06e+09{col 46} 3.81e+10{col 58} 5.17e+09{col 70} 9.34e+09
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}-1.92e+10{col 34} 2.13e+09{col 58}-2.34e+10{col 70}-1.50e+10
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res} -8.9901
{txt}Ho: diff = 0                                     degrees of freedom = {res}    1283

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}1.0000

{com}. 
. * Before regressing any of our variables we can already see that a higher Gross Domestic Product value will be associated with a signficant change in Foreign Direct Investment. 

. * We reject the null hypothesis that having a country with an above average GDP can draw in FDI at the same rate that a country with below average GDP at the 1%, 5%, and 10% signficant levels. This is reflected in our t-value of -8.9901. 

. 
. regress FDI GDP, robust 

{txt}Linear regression                               Number of obs     = {res}     1,280
                                                {txt}F(1, 1278)        =  {res}   213.01
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8630
                                                {txt}Root MSE          =    {res} 1.4e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         FDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}GDP {c |}{col 14}{res}{space 2} .0177545{col 26}{space 2} .0012165{col 37}{space 1}   14.60{col 46}{space 3}0.000{col 54}{space 4} .0153679{col 67}{space 3}  .020141
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.59e+08{col 26}{space 2} 2.38e+08{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 54}{space 4}-3.09e+08{col 67}{space 3} 6.26e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. * If we want to run a simple linear regression with FDI as our dependent variable and GDP as our independent variable, we will need to modify our variables. We can see that, without converting our varibales into a log format, this a little inconvenient to interpret; we are also left with a statistically insignificant intercept value. If we were to interpret this regression, we could see that for every $1 increase in GDP value, FDI will go up by roughly $.0176. 

. gen lnFDI = ln(FDI)
{txt}(533 missing values generated)

{com}. gen lnGDP = ln(GDP)
{txt}(87 missing values generated)

{com}. * I will be converting all my large numerical variables into a log format, and, as you will see, many of my explanatory variables as well. 

. reg lnFDI lnGDP, robust

{txt}Linear regression                               Number of obs     = {res}     1,174
                                                {txt}F(1, 1172)        =  {res}  5241.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7720
                                                {txt}Root MSE          =    {res} 1.2588

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9347046{col 26}{space 2} .0129104{col 37}{space 1}   72.40{col 46}{space 3}0.000{col 54}{space 4} .9093745{col 67}{space 3} .9600346
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.460132{col 26}{space 2} .3083354{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-3.065083{col 67}{space 3}-1.855181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. * Now we have an intercept value that is statistically signficant at the 1%, 5%, and 10% signficant levels. We can also see that for every 1% increase in Gross Domestic Product, there is going to be a .9347046% increase in Foreign Direct Investment. 

. display e(r2_a) 
{res}.77180181

{com}. * The coefficent of determination (r^2 value) will determine the "goodness of fit", essentially how well our regression model predicts future observations. In other words, the r^2 value is a measure of how well a variance in our independent variable predicts a variance in our dependent variable. We can see from a r^2 value of roughly .7718, that a variance in GDP explains roughly 77.18% of a variance in FDI. 

. *graph twoway (lfitci lnFDI lnGDP) (scatter lnFDI lnGDP)

. * Here is graphical representation of my regression. 

. reg lnFDI lnGDP, r

{txt}Linear regression                               Number of obs     = {res}     1,174
                                                {txt}F(1, 1172)        =  {res}  5241.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7720
                                                {txt}Root MSE          =    {res} 1.2588

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9347046{col 26}{space 2} .0129104{col 37}{space 1}   72.40{col 46}{space 3}0.000{col 54}{space 4} .9093745{col 67}{space 3} .9600346
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.460132{col 26}{space 2} .3083354{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-3.065083{col 67}{space 3}-1.855181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. predict resid, residuals
{txt}(537 missing values generated)

{com}. * One common way to test the strength of our regression is to plot the residual deviation from the predicted values in our regression slope. If the observed value deviate from our predicted values in a non-random order, we can claim that there is some bias that the simple linear regression, with log transformations, is ignoring.

. gen time = _n

. line resid time, yline(0)
{res}
{com}. scatter resid time, yline(0)
{res}
{com}. * Fortunately, in both residual plots, one where we use scatter plot observations and one where we use a line plot, we can see random, unbiased variation of the residuals in the regression. In other words, our observed variables don't gear off into an unexplained pattern outside of our regression slope. 

. 
. * To explain the value of adding ", robust" at the end of our regression, we can see that without the command our standard errors (and thus our signficant levels) are altered. We will also that this regression is going to be biased, as it fails the  heteroskedasticity test. Since we reject the null hypothesis, at the 1% level, of equal variance between residuals, we can say that these residuals are not homoskedastic and biased. 

. reg lnFDI lnGDP, r

{txt}Linear regression                               Number of obs     = {res}     1,174
                                                {txt}F(1, 1172)        =  {res}  5241.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7720
                                                {txt}Root MSE          =    {res} 1.2588

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9347046{col 26}{space 2} .0129104{col 37}{space 1}   72.40{col 46}{space 3}0.000{col 54}{space 4} .9093745{col 67}{space 3} .9600346
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.460132{col 26}{space 2} .3083354{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-3.065083{col 67}{space 3}-1.855181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg lnFDI lnGDP

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,174
{txt}{hline 13}{c +}{hline 34}   F(1, 1172)      = {res}  3968.27
{txt}       Model {c |} {res} 6288.46025         1  6288.46025   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  1857.2521     1,172  1.58468609   {txt}R-squared       ={res}    0.7720
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7718
{txt}       Total {c |} {res} 8145.71234     1,173   6.9443413   {txt}Root MSE        =   {res} 1.2588

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9347046{col 26}{space 2} .0148379{col 37}{space 1}   62.99{col 46}{space 3}0.000{col 54}{space 4} .9055927{col 67}{space 3} .9638165
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.460132{col 26}{space 2} .3455353{col 37}{space 1}   -7.12{col 46}{space 3}0.000{col 54}{space 4}-3.138069{col 67}{space 3}-1.782195
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. *hettest

. 
. * Now, moving onto testing for control variables, we need to be very careful on what we add to the regression. Firstly, we run into a clear problem if we try to add all the control variables into the regression at once. 

. * reg lnFDI lnGDP GINI POVERTY EXCHANGE LIFE MORT SCHOOL DEBT CRIME ENERGY LIT TAX LEGAL ELEC EASE, r

. * There are no observations. This means that there are no cells in my data frame where there is an observation made for all of these 16 variables at once. This is understandable, but it is clear that at least one of my variables must not have of many observations attched to it from the beginning. 

. * It's clear that I need to delete at least one of my variables of interest, so I want to strategically do so without losing much explanatory power. 

. 
. cor lnFDI DEBT
{txt}(obs=201)

             {c |}    lnFDI     DEBT
{hline 13}{c +}{hline 18}
       lnFDI {c |}{res}   1.0000
        {txt}DEBT {c |}{res}  -0.0850   1.0000


{com}. * Here we see that the Debt to GDP ratio has a very weak negative linear relationship with our dependent variable, so we may be able to eliminate it without much issue. 

. sum LITERACY

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}LITERACY {c |}{res}        204    96.52051    5.423395   51.15302    99.9556

{com}. sum SCHOOL

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}SCHOOL {c |}{res}        695    89.60597    10.46667   36.70574        100

{com}. cor LITERACY SCHOOL
{txt}(obs=155)

             {c |} LITERACY   SCHOOL
{hline 13}{c +}{hline 18}
    LITERACY {c |}{res}   1.0000
      {txt}SCHOOL {c |}{res}   0.6976   1.0000


{com}. * We can also see that for literacy rate data there are only 204 observations across all 38 countries, in contrast to over triple that amount for SCHOOL. And given that it is correlated with the variable SCHOOL at a coefficent value of .6976, this explanatory variable would be best left out. 

. cor ELEC lnGDP
{txt}(obs=950)

             {c |}     ELEC    lnGDP
{hline 13}{c +}{hline 18}
        ELEC {c |}{res}   1.0000
       {txt}lnGDP {c |}{res}   0.7014   1.0000


{com}. * We can also see that % change in GDP is strongly positively correlated with total per capita electricity consumption at a coefficent value of .7014. We should eliminate this variable, as it would appear superfluous in its explanatory power and won't allow the regression to run properly. 

. 
. * Although I imported a wide variety of control variables, I knew that some of them will definitely be extraneous and if we were to add all of these predictor variables, minus the ones just mentioned, into the regression at the same time, we would end up with a biased regression and unreliable coefficent of effects for our explanatory variables. Here I will show an example of this by simple running a mutliple linear regression with all of our variables in it.  

. * After eliminating these variables we end up with this: 

. reg lnFDI lnGDP GINI POVERTY EXCHANGE LIFE MORT SCHOOL CRIME ENERGY TAX LEGAL EASE, r

{txt}Linear regression                               Number of obs     = {res}        32
                                                {txt}F(12, 19)         =  {res}    56.64
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.9255
                                                {txt}Root MSE          =    {res} .60754

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.316643{col 26}{space 2} .2576652{col 37}{space 1}    5.11{col 46}{space 3}0.000{col 54}{space 4} .7773436{col 67}{space 3} 1.855942
{txt}{space 8}GINI {c |}{col 14}{res}{space 2}-.0269958{col 26}{space 2} .0580917{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-.1485831{col 67}{space 3} .0945916
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2}-.0783257{col 26}{space 2} .0615682{col 37}{space 1}   -1.27{col 46}{space 3}0.219{col 54}{space 4}-.2071894{col 67}{space 3}  .050538
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2} .0009306{col 26}{space 2} .0012848{col 37}{space 1}    0.72{col 46}{space 3}0.478{col 54}{space 4}-.0017585{col 67}{space 3} .0036197
{txt}{space 8}LIFE {c |}{col 14}{res}{space 2} .3371477{col 26}{space 2} .1236063{col 37}{space 1}    2.73{col 46}{space 3}0.013{col 54}{space 4} .0784368{col 67}{space 3} .5958586
{txt}{space 8}MORT {c |}{col 14}{res}{space 2} .1128862{col 26}{space 2}  .042271{col 37}{space 1}    2.67{col 46}{space 3}0.015{col 54}{space 4}  .024412{col 67}{space 3} .2013604
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .0038889{col 26}{space 2} .0445823{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.0894229{col 67}{space 3} .0972007
{txt}{space 7}CRIME {c |}{col 14}{res}{space 2} .0046772{col 26}{space 2} .0100654{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.0163899{col 67}{space 3} .0257443
{txt}{space 6}ENERGY {c |}{col 14}{res}{space 2}-.0795658{col 26}{space 2} .0549855{col 37}{space 1}   -1.45{col 46}{space 3}0.164{col 54}{space 4}-.1946517{col 67}{space 3} .0355201
{txt}{space 9}TAX {c |}{col 14}{res}{space 2}-.0155277{col 26}{space 2} .0129887{col 37}{space 1}   -1.20{col 46}{space 3}0.247{col 54}{space 4}-.0427134{col 67}{space 3}  .011658
{txt}{space 7}LEGAL {c |}{col 14}{res}{space 2} .2395517{col 26}{space 2} .1481404{col 37}{space 1}    1.62{col 46}{space 3}0.122{col 54}{space 4}-.0705098{col 67}{space 3} .5496131
{txt}{space 8}EASE {c |}{col 14}{res}{space 2}-.1244516{col 26}{space 2}  .101146{col 37}{space 1}   -1.23{col 46}{space 3}0.234{col 54}{space 4}-.3361526{col 67}{space 3} .0872494
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-23.00374{col 26}{space 2} 9.002349{col 37}{space 1}   -2.56{col 46}{space 3}0.019{col 54}{space 4}-41.84587{col 67}{space 3}-4.161606
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. * While nothing was automatically eliminated due to collinearity, we can definitely do better in controlling for endogeneity bias. First off all, the only variable that is statistically signficant at the 1% level is lnGDP, and no other coefficent is statistically signficant even at the 10% level. Secondly, some of these coefficents of effects don't logically make sense, as with for example the % change in mortality rates having a positive effect on FDI.

. 
. * Before going any further I want to transform some my variables into log values. 

. gen lnLIFE = ln(LIFE)
{txt}(54 missing values generated)

{com}. gen lnMORT = ln(MORT)
{txt}(98 missing values generated)

{com}. gen lnCRIME = ln(CRIME)
{txt}(1,087 missing values generated)

{com}. * I transformed some my rate variables so now they will represent percents in the regression interpretation. 

. 
. reg lnFDI lnGDP GINI POVERTY EXCHANGE lnLIFE lnMORT SCHOOL lnCRIME ENERGY LIT TAX LEGAL EASE

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        22
{txt}{hline 13}{c +}{hline 34}   F(13, 8)        = {res}    16.65
{txt}       Model {c |} {res} 59.1524991        13  4.55019224   {txt}Prob > F        ={res}    0.0002
{txt}    Residual {c |} {res} 2.18691658         8  .273364573   {txt}R-squared       ={res}    0.9643
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.9064
{txt}       Total {c |} {res} 61.3394156        21  2.92092455   {txt}Root MSE        =   {res} .52284

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 2.854379{col 26}{space 2} 1.191372{col 37}{space 1}    2.40{col 46}{space 3}0.043{col 54}{space 4} .1070698{col 67}{space 3} 5.601688
{txt}{space 8}GINI {c |}{col 14}{res}{space 2}-.2840287{col 26}{space 2} .3969168{col 37}{space 1}   -0.72{col 46}{space 3}0.495{col 54}{space 4}-1.199321{col 67}{space 3} .6312632
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2}-.1160324{col 26}{space 2} .3649826{col 37}{space 1}   -0.32{col 46}{space 3}0.759{col 54}{space 4}-.9576838{col 67}{space 3}  .725619
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2} .0135631{col 26}{space 2} .0058611{col 37}{space 1}    2.31{col 46}{space 3}0.049{col 54}{space 4} .0000475{col 67}{space 3} .0270788
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2}-48.50538{col 26}{space 2} 47.64076{col 37}{space 1}   -1.02{col 46}{space 3}0.338{col 54}{space 4}-158.3652{col 67}{space 3} 61.35441
{txt}{space 6}lnMORT {c |}{col 14}{res}{space 2} 2.194393{col 26}{space 2} 2.151478{col 37}{space 1}    1.02{col 46}{space 3}0.338{col 54}{space 4}-2.766924{col 67}{space 3} 7.155709
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .2351064{col 26}{space 2} .1157989{col 37}{space 1}    2.03{col 46}{space 3}0.077{col 54}{space 4}-.0319262{col 67}{space 3} .5021391
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-2.419794{col 26}{space 2} 1.202647{col 37}{space 1}   -2.01{col 46}{space 3}0.079{col 54}{space 4}-5.193103{col 67}{space 3} .3535145
{txt}{space 6}ENERGY {c |}{col 14}{res}{space 2} .1371445{col 26}{space 2} .1204798{col 37}{space 1}    1.14{col 46}{space 3}0.288{col 54}{space 4}-.1406824{col 67}{space 3} .4149715
{txt}{space 4}LITERACY {c |}{col 14}{res}{space 2} -1.58985{col 26}{space 2} 1.238685{col 37}{space 1}   -1.28{col 46}{space 3}0.235{col 54}{space 4}-4.446262{col 67}{space 3} 1.266563
{txt}{space 9}TAX {c |}{col 14}{res}{space 2} -.099194{col 26}{space 2} .0486907{col 37}{space 1}   -2.04{col 46}{space 3}0.076{col 54}{space 4} -.211475{col 67}{space 3} .0130869
{txt}{space 7}LEGAL {c |}{col 14}{res}{space 2} 1.409554{col 26}{space 2} .5890166{col 37}{space 1}    2.39{col 46}{space 3}0.044{col 54}{space 4} .0512791{col 67}{space 3} 2.767828
{txt}{space 8}EASE {c |}{col 14}{res}{space 2}-.8626582{col 26}{space 2} .3654791{col 37}{space 1}   -2.36{col 46}{space 3}0.046{col 54}{space 4}-1.705455{col 67}{space 3}-.0198619
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  344.228{col 26}{space 2} 286.1049{col 37}{space 1}    1.20{col 46}{space 3}0.263{col 54}{space 4} -315.531{col 67}{space 3} 1003.987
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 8}EASE {c |} {res}   406.75    0.002458
{txt}{space 7}LEGAL {c |} {res}   290.75    0.003439
{txt}{space 7}lnGDP {c |} {res}   250.53    0.003992
{txt}{space 8}GINI {c |} {res}   238.76    0.004188
{txt}{space 5}POVERTY {c |} {res}   215.58    0.004639
{txt}{space 6}lnLIFE {c |} {res}   156.59    0.006386
{txt}{space 5}lnCRIME {c |} {res}   125.28    0.007982
{txt}{space 4}LITERACY {c |} {res}   104.90    0.009533
{txt}{space 4}EXCHANGE {c |} {res}    94.22    0.010613
{txt}{space 9}TAX {c |} {res}    67.91    0.014725
{txt}{space 6}lnMORT {c |} {res}    47.76    0.020937
{txt}{space 6}SCHOOL {c |} {res}    41.54    0.024073
{txt}{space 6}ENERGY {c |} {res}    11.83    0.084538
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}   157.88

{com}. * Multicollinearity occurs when different explanatory variables in our regression are linearly related with each other, obfuscating some of the predictive power of our variables. 

. * Lets try to control for multicollinearity within the regression. The command, "vif", stands for the Variance Inflation Factor and is a good measure of the multicollinearity in a set of mutliple regression variables. Under a case with zero multicollinearity the vif value would be 0, and any vif value below 3 is considered to be problematic; these vif values are certainly problematic. The mean vif value is 107.62! The lowest one still being problematic at 10.94. We must omit at least a couple of these variables in order for them to not give biased effect results. 

. 
. ssc install ridgereg
{txt}checking {hilite:ridgereg} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. * We can see that there are erros with multicollinearity within my regression, so we are going to have to attempt to control for that with a ridge regression, which accounts for a small bias factor in my explanatory coefficents to offset potential problems with collinearity. First, we need to run a multicollinearity test, to attempt to determine which variables are the most influential in obfuscating the effects of others. 

. * If kr(0) in ridge(orr, grr1, grr2, grr3), the model will be an OLS regression model(orr) : Ordinary Ridge Regression. 

. 
. set matsize 800, permanently
{txt}({cmd:set matsize} preference recorded)
{bf:set matsize} ignored.
{p 4 4 2}
Matrix sizes are no longer limited by
{bf:c(matsize)} in modern Statas.
Matrix sizes are now limited by flavor of Stata.
See {help limits} for more details.
{p_end}

{com}. * We need to expand our matrix size, to handle the number of observations coming in for our analysis. 

. 
. ridgereg lnFDI lnGDP GINI POVERTY EXCHANGE lnLIFE lnMORT SCHOOL lnCRIME ENERGY LIT TAX LEGAL EASE, model(orr) kr(0) diag lmcol mfx(lin)
{res}
{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}
{txt}{bf:{err:* (OLS) Ridge Regression - {cmd:{bf:Ordinary Ridge Regression}}}}
{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}
{res}{p 2 8 5}{bf:lnFDI}{txt} = 
 {res} {bf:lnGDP}{txt} +  {res} {bf:GINI}{txt} +  {res} {bf:POVERTY}{txt} +  {res} {bf:EXCHANGE}{txt} +  {res} {bf:lnLIFE}{txt} +  {res} {bf:lnMORT}{txt} +  {res} {bf:SCHOOL}{txt} +  {res} {bf:lnCRIME}{txt} +  {res} {bf:ENERGY}{txt} +  {res} {bf:LITERACY}{txt} +  {res} {bf:TAX}{txt} +  {res} {bf:LEGAL}{txt} +  {res}{bf:EASE}
{p_end}
{txt}{hline 78}
{col 3}{bf:Ridge k Value}{col 21}={res}   0.00000{col 37}|{col 41}{bf:Ordinary Ridge Regression}
------------------------------------------------------------------------------
{txt}{col 3}Sample Size{col 21}={res}          22
{txt}{col 3}{cmd:Wald Test}{col 21}={res}    216.3869{col 37}|{col 41}{txt}P-Value > {cmd:Chi2}({res}13){col 65}=      0.0000
{txt}{col 3}{cmd:F-Test}{col 21}={res}     16.6451{col 37}|{col 41}{txt}P-Value > {cmd:F}({res}13 , 8){col 65}=      0.0002
{txt}{col 2}(Buse 1973) R2{col 21}={res}      0.9643{col 37}|{txt}{col 41}Raw Moments R2{col 65}={res}      0.9998
{txt}{col 2}(Buse 1973) R2 Adj{col 21}={res}      0.9064{col 37}|{txt}{col 41}Raw Moments R2 Adj{col 65}={res}      0.9995
{txt}{col 3}Root MSE (Sigma){col 21}={res}      0.5228{txt}{col 37}|{col 41}Log Likelihood Function{col 65}={res}     -5.8226
------------------------------------------------------------------------------
{txt}- {cmd:R2h}={res} 0.9643{col 17}{txt}{cmd:R2h Adj}={res} 0.9064{txt}{col 34}{cmd:F-Test} ={res}   16.65{col 51}{txt}P-Value > F({res}13 , 8){col 72}0.0002
{txt}- {cmd:R2v}={res} 0.9643{col 17}{txt}{cmd:R2v Adj}={res} 0.9064{txt}{col 34}{cmd:F-Test} ={res}   16.65{col 51}{txt}P-Value > F({res}13 , 8){col 72}0.0002
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 2.854379{col 26}{space 2} 1.191372{col 37}{space 1}    2.40{col 46}{space 3}0.043{col 54}{space 4} .1070698{col 67}{space 3} 5.601688
{txt}{space 8}GINI {c |}{col 14}{res}{space 2}-.2840287{col 26}{space 2} .3969168{col 37}{space 1}   -0.72{col 46}{space 3}0.495{col 54}{space 4}-1.199321{col 67}{space 3} .6312632
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2}-.1160324{col 26}{space 2} .3649826{col 37}{space 1}   -0.32{col 46}{space 3}0.759{col 54}{space 4}-.9576838{col 67}{space 3}  .725619
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2} .0135631{col 26}{space 2} .0058611{col 37}{space 1}    2.31{col 46}{space 3}0.049{col 54}{space 4} .0000475{col 67}{space 3} .0270788
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2}-48.50538{col 26}{space 2} 47.64076{col 37}{space 1}   -1.02{col 46}{space 3}0.338{col 54}{space 4}-158.3652{col 67}{space 3} 61.35441
{txt}{space 6}lnMORT {c |}{col 14}{res}{space 2} 2.194393{col 26}{space 2} 2.151478{col 37}{space 1}    1.02{col 46}{space 3}0.338{col 54}{space 4}-2.766924{col 67}{space 3} 7.155709
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .2351064{col 26}{space 2} .1157989{col 37}{space 1}    2.03{col 46}{space 3}0.077{col 54}{space 4}-.0319262{col 67}{space 3} .5021391
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-2.419794{col 26}{space 2} 1.202647{col 37}{space 1}   -2.01{col 46}{space 3}0.079{col 54}{space 4}-5.193103{col 67}{space 3} .3535145
{txt}{space 6}ENERGY {c |}{col 14}{res}{space 2} .1371445{col 26}{space 2} .1204798{col 37}{space 1}    1.14{col 46}{space 3}0.288{col 54}{space 4}-.1406824{col 67}{space 3} .4149715
{txt}{space 4}LITERACY {c |}{col 14}{res}{space 2} -1.58985{col 26}{space 2} 1.238685{col 37}{space 1}   -1.28{col 46}{space 3}0.235{col 54}{space 4}-4.446262{col 67}{space 3} 1.266563
{txt}{space 9}TAX {c |}{col 14}{res}{space 2} -.099194{col 26}{space 2} .0486907{col 37}{space 1}   -2.04{col 46}{space 3}0.076{col 54}{space 4} -.211475{col 67}{space 3} .0130869
{txt}{space 7}LEGAL {c |}{col 14}{res}{space 2} 1.409554{col 26}{space 2} .5890166{col 37}{space 1}    2.39{col 46}{space 3}0.044{col 54}{space 4} .0512791{col 67}{space 3} 2.767828
{txt}{space 8}EASE {c |}{col 14}{res}{space 2}-.8626582{col 26}{space 2} .3654791{col 37}{space 1}   -2.36{col 46}{space 3}0.046{col 54}{space 4}-1.705455{col 67}{space 3}-.0198619
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  344.228{col 26}{space 2} 286.1049{col 37}{space 1}    1.20{col 46}{space 3}0.263{col 54}{space 4} -315.531{col 67}{space 3} 1003.987
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}
{bf:{err:* OLS Model Selection Diagnostic Criteria - Model= ({bf:{err:orr}})}}
{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}
- Log Likelihood Function{col 45}LLF{col 60}=     -5.8226
---------------------------------------------------------------------------
- Akaike Information Criterion{col 45}(1974) AIC{col 60}=      0.3549
- Akaike Information Criterion{col 45}(1973) Log AIC{col 60}=     -1.0358
---------------------------------------------------------------------------
- Schwarz Criterion{col 45}(1978) SC{col 60}=      0.7107
- Schwarz Criterion{col 45}(1978) Log SC{col 60}=     -0.3415
---------------------------------------------------------------------------
- Amemiya Prediction Criterion{col 45}(1969) FPE{col 60}=      0.4473
- Hannan-Quinn Criterion{col 45}(1979) HQ{col 60}=      0.4180
- Rice Criterion{col 45}(1984) Rice{col 60}=     -0.3645
- Shibata Criterion{col 45}(1981) Shibata{col 60}=      0.2259
- Craven-Wahba Generalized Cross Validation{col 45}(1979) GCV{col 60}=      0.7518
------------------------------------------------------------------------------

{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}
{bf:{err:*** Multicollinearity Diagnostic Tests - Model= ({bf:{err:orr}})}}
{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}{bf:{err:=}}

{bf:{err:* Correlation Matrix}}
(obs=22)

             {c |}    lnGDP     GINI  POVERTY EXCHANGE   lnLIFE   lnMORT   SCHOOL  lnCRIME   ENERGY LITERACY      TAX    LEGAL     EASE
{hline 13}{c +}{hline 117}
       lnGDP {c |}{res}   1.0000
        {txt}GINI {c |}{res}   0.5109   1.0000
     {txt}POVERTY {c |}{res}  -0.3262   0.5347   1.0000
    {txt}EXCHANGE {c |}{res}   0.1233  -0.0546  -0.2402   1.0000
      {txt}lnLIFE {c |}{res}   0.3728  -0.0455  -0.2939   0.6137   1.0000
      {txt}lnMORT {c |}{res}  -0.1804   0.3972   0.4688  -0.5548  -0.8070   1.0000
      {txt}SCHOOL {c |}{res}   0.6772  -0.0380  -0.6813   0.1351   0.5617  -0.4426   1.0000
     {txt}lnCRIME {c |}{res}  -0.2550   0.1544   0.4127  -0.4122  -0.6181   0.3490  -0.6320   1.0000
      {txt}ENERGY {c |}{res}   0.5391  -0.1372  -0.7564   0.2421   0.4903  -0.5296   0.6549  -0.3004   1.0000
    {txt}LITERACY {c |}{res}   0.5836  -0.1346  -0.8073   0.1611   0.3022  -0.2390   0.8162  -0.6942   0.6440   1.0000
         {txt}TAX {c |}{res}   0.4223   0.2980  -0.0191  -0.2499  -0.2929   0.2138   0.2721  -0.0165   0.0578   0.2799   1.0000
       {txt}LEGAL {c |}{res}  -0.3196  -0.3225   0.2280  -0.0651  -0.1777  -0.0830  -0.4585   0.5568  -0.3847  -0.5734  -0.3715   1.0000
        {txt}EASE {c |}{res}   0.1237  -0.4471  -0.4107   0.5323   0.4712  -0.5305   0.1950  -0.2121   0.1997   0.1568  -0.4844   0.5651   1.0000

{txt}{bf:{err:* Multicollinearity Diagnostic Criteria}}
{res}{txt}{space 0}{c TLC}{hline 7}{c  TT}{hline 11}{c  TT}{hline 11}{c  TT}{hline 11}{c  TT}{hline 11}{c  TT}{hline 11}{c  TT}{hline 11}{c TRC}
{space 0}{c |}{space 1}{ralign 5:Var}{space 1}{c |}{space 1}{ralign 9:Eigenval}{space 1}{c |}{space 1}{ralign 9:C_Number}{space 1}{c |}{space 1}{ralign 9:C_Index}{space 1}{c |}{space 1}{ralign 9:VIF}{space 1}{c |}{space 1}{ralign 9:1/VIF}{space 1}{c |}{space 1}{ralign 9:R2_xi,X}{space 1}{c |}
{space 0}{c  LT}{hline 7}{c   +}{hline 11}{c   +}{hline 11}{c   +}{hline 11}{c   +}{hline 11}{c   +}{hline 11}{c   +}{hline 11}{c  RT}
{space 0}{c |}{space 1}{ralign 5:lnGDP}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   5.2450}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.0000}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.0000}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 250.5322}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0040}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9960}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:GINI}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   2.9979}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.7496}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.3227}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 238.7585}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0042}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9958}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:POV~Y}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.5203}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   3.4499}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.8574}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 215.5837}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0046}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9954}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:EXC~E}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   1.1422}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   4.5921}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   2.1429}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  94.2210}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0106}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9894}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:lnL~E}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.7042}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   7.4478}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   2.7291}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 156.5856}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0064}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9936}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:lnM~T}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.5917}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   8.8636}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   2.9772}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  47.7633}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0209}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9791}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:SCH~L}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.5471}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   9.5861}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   3.0961}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  41.5410}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0241}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9759}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:lnC~E}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.1253}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  41.8572}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   6.4697}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 125.2834}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0080}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9920}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:ENE~Y}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0905}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  57.9458}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   7.6122}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  11.8291}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0845}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9155}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:LIT~Y}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0295}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 178.0039}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  13.3418}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 104.8953}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0095}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9905}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:TAX}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0036}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:1466.3407}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  38.2928}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  67.9120}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0147}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9853}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:LEGAL}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0017}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:3070.8772}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  55.4155}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 290.7506}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0034}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9966}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 5:EASE}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0009}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:5913.2031}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:  76.8974}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 406.7521}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.0025}}}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   0.9975}}}{space 1}{c |}
{space 0}{c BLC}{hline 7}{c  BT}{hline 11}{c  BT}{hline 11}{c  BT}{hline 11}{c  BT}{hline 11}{c  BT}{hline 11}{c  BT}{hline 11}{c BRC}
{res}
{txt}{bf:{err:* Farrar-Glauber Multicollinearity Tests}}
{col 3}Ho: No Multicollinearity - Ha: Multicollinearity
--------------------------------------------------

{bf:* (1) Farrar-Glauber Multicollinearity Chi2-Test:}
{col 5}Chi2 Test = {res} 399.1327{txt}{col 30}P-Value > Chi2(78) {res}{col 45}0.0000

{txt}{bf:* (2) Farrar-Glauber Multicollinearity F-Test:}
{res}{txt}{space 0}{c TLC}{hline 12}{c  TT}{hline 10}{c  TT}{hline 10}{c  TT}{hline 10}{c  TT}{hline 10}{c TRC}
{space 0}{c |}{space 1}{ralign 10:Variable}{space 1}{c |}{space 1}{ralign 8:F_Test}{space 1}{c |}{space 1}{ralign 8:DF1}{space 1}{c |}{space 1}{ralign 8:DF2}{space 1}{c |}{space 1}{ralign 8:P_Value}{space 1}{c |}
{space 0}{c  LT}{hline 12}{c   +}{hline 10}{c   +}{hline 10}{c   +}{hline 10}{c   +}{hline 10}{c  RT}
{space 0}{c |}{space 1}{ralign 10:lnGDP}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 187.150}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:GINI}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 178.318}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:POVERTY}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 160.938}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:EXCHANGE}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  69.916}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnLIFE}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 116.689}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnMORT}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  35.072}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:SCHOOL}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  30.406}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnCRIME}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  93.213}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:ENERGY}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   8.122}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:LITERACY}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  77.922}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:TAX}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  50.184}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:LEGAL}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 217.313}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:EASE}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 304.312}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   9.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  13.000}}}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   0.000}}}{space 1}{c |}
{space 0}{c BLC}{hline 12}{c  BT}{hline 10}{c  BT}{hline 10}{c  BT}{hline 10}{c  BT}{hline 10}{c BRC}

{bf:* (3) Farrar-Glauber Multicollinearity t-Test:}
{res}{txt}{space 0}{c TLC}{hline 10}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c TRC}
{space 0}{c |}{space 1}{ralign 8:Variable}{space 1}{c |}{space 1}{ralign 6:lnGDP}{space 1}{c |}{space 1}{ralign 6:GINI}{space 1}{c |}{space 1}{ralign 6:POVE~Y}{space 1}{c |}{space 1}{ralign 6:EXCH~E}{space 1}{c |}{space 1}{ralign 6:lnLIFE}{space 1}{c |}{space 1}{ralign 6:lnMORT}{space 1}{c |}{space 1}{ralign 6:SCHOOL}{space 1}{c |}{space 1}{ralign 6:lnCR~E}{space 1}{c |}{space 1}{ralign 6:ENERGY}{space 1}{c |}{space 1}{ralign 6:LITE~Y}{space 1}{c |}{space 1}{ralign 6:TAX}{space 1}{c |}{space 1}{ralign 6:LEGAL}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}
{space 0}{c  LT}{hline 10}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c  RT}
{space 0}{c |}{space 1}{ralign 8:lnGDP}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.783}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.035}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.373}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.205}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.550}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.761}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.791}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.920}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.156}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:GINI}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.783}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.898}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.164}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.137}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.298}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.114}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.469}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.416}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.408}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:POVERTY}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.035}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.898}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.742}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.922}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.592}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.793}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.359}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-3.469}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-4.105}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EXCHANGE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.373}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.164}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.742}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.332}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.409}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.357}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.748}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.490}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnLIFE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.205}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.137}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.922}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.332}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-4.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.037}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.359}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.688}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.951}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnMORT}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.550}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.298}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.592}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-4.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.481}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.117}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.873}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.738}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:SCHOOL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.761}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.114}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.793}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.409}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.037}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.481}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.446}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.600}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 4.238}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnCRIME}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.791}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.469}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.359}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.357}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.359}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.117}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.446}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.945}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.893}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:ENERGY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.920}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.416}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-3.469}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.748}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.688}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.873}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.600}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.945}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.525}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LITERACY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.156}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.408}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-4.105}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.490}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.951}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.738}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 4.238}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.893}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.525}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.156}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.408}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-4.105}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.490}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.951}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.738}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 4.238}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.893}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.525}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:TAX}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.398}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.936}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.057}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.774}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.919}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.657}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.848}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.049}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.174}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.875}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LEGAL}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.012}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.022}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.702}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.196}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.542}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.548}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.011}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EASE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.374}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.499}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.351}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.886}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.603}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.877}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.596}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.651}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.611}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.476}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c BLC}{hline 10}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c BRC}

{space 0}{c TLC}{hline 10}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c TRC}
{space 0}{c |}{space 1}{ralign 8:Variable}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}
{space 0}{c  LT}{hline 10}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c  RT}
{space 0}{c |}{space 1}{ralign 8:lnGDP}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.398}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.012}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.374}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:GINI}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.936}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.022}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.499}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:POVERTY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.057}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.702}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.351}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EXCHANGE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.774}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.196}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.886}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnLIFE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.919}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.542}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.603}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnMORT}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.657}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.877}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:SCHOOL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.848}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.548}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.596}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnCRIME}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.049}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.011}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.651}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:ENERGY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.174}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.611}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LITERACY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.875}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.476}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.875}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.476}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:TAX}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.200}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.661}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.774}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.919}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.657}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.848}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.049}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.174}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.875}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.200}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.661}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LEGAL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.200}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.055}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.012}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.022}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.702}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.196}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EASE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.661}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.055}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c BLC}{hline 10}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c BRC}

{space 0}{c TLC}{hline 10}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c  TT}{hline 8}{c TRC}
{space 0}{c |}{space 1}{ralign 8:Variable}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}
{space 0}{c  LT}{hline 10}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c   +}{hline 8}{c  RT}
{space 0}{c |}{space 1}{ralign 8:lnGDP}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:GINI}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:POVERTY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EXCHANGE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnLIFE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnMORT}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:SCHOOL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnCRIME}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:ENERGY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LITERACY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:TAX}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LEGAL}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.542}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.548}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.011}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.250}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-2.100}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.200}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.055}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EASE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.374}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.499}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.351}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.886}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 1.603}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.877}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.596}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-0.651}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.611}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.476}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:-1.661}}}{space 1}{c |}
{space 0}{c BLC}{hline 10}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c  BT}{hline 8}{c BRC}

{space 0}{c TLC}{hline 10}{c  TT}{hline 8}{c  TT}{hline 8}{c TRC}
{space 0}{c |}{space 1}{ralign 8:Variable}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}{space 1}{ralign 6:EASE}{space 1}{c |}
{space 0}{c  LT}{hline 10}{c   +}{hline 8}{c   +}{hline 8}{c  RT}
{space 0}{c |}{space 1}{ralign 8:lnGDP}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:GINI}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:POVERTY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EXCHANGE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnLIFE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnMORT}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:SCHOOL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:lnCRIME}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:ENERGY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LITERACY}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:TAX}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:LEGAL}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 8:EASE}{space 1}{c |}{space 1}{ralign 6:{res:{sf: 2.055}}}{space 1}{c |}{space 1}{ralign 6:{res:{sf:     .}}}{space 1}{c |}
{space 0}{c BLC}{hline 10}{c  BT}{hline 8}{c  BT}{hline 8}{c BRC}

{bf:{err:* |X'X| Determinant:}}
{col 3}{bf:|X'X| = 0 Multicollinearity - |X'X| = 1 No Multicollinearity}
{col 3}|X'X| Determinant: {res}{col 28}(0 < 0.0000 < 1)
---------------------------------------------------------------

{txt}{bf:{err:* Theil R2 Multicollinearity Effect:}}
{col 3}{bf:R2 = 0 No Multicollinearity - R2 = 1 Multicollinearity}
{col 6}- Theil R2: {res}{col 28}(0 < 0.7845 < 1)
---------------------------------------------------------------

{txt}{bf:{err:* Multicollinearity Range:}}
{col 3}{bf:Q = 0 No Multicollinearity - Q = 1 Multicollinearity}
{col 5} - Gleason-Staelin Q0: {res}{col 28}(0 < 0.4258 < 1)
{txt}{col 5}1- Heo Range Q1: {res}{col 28}(0 < 0.9975 < 1)
{txt}{col 5}2- Heo Range Q2: {res}{col 28}(0 < 0.9937 < 1)
{txt}{col 5}3- Heo Range Q3: {res}{col 28}(0 < 1.0000 < 1)
{txt}{col 5}4- Heo Range Q4: {res}{col 28}(0 < 0.2563 < 1)
{txt}{col 5}5- Heo Range Q5: {res}{col 28}(0 < 0.9997 < 1)
{txt}{col 5}6- Heo Range Q6: {res}{col 28}(0 < 0.9848 < 1)
------------------------------------------------------------------------------

{txt}{p 0 0 2}{bf:* Marginal Effect - Elasticity {bf:(Model= {err:orr})}: {err:Linear} *}{p_end}

{space 0}{c TLC}{hline 12}{c  TT}{hline 20}{c  TT}{hline 20}{c  TT}{hline 20}{c TRC}
{space 0}{c |}{space 1}{ralign 10:Variable}{space 1}{c |}{space 1}{ralign 18:Marginal_Effect(B)}{space 1}{c |}{space 1}{ralign 18:Elasticity(Es)}{space 1}{c |}{space 1}{ralign 18:Mean}{space 1}{c |}
{space 0}{c  LT}{hline 12}{c   +}{hline 20}{c   +}{hline 20}{c   +}{hline 20}{c  RT}
{space 0}{c |}{space 1}{ralign 10:lnGDP}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            2.8544}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            3.3257}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           25.6469}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:GINI}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.2840}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.5823}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           45.1318}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:POVERTY}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.1160}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.0202}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            3.8227}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:EXCHANGE}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.0136}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.0425}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           68.9076}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnLIFE}{space 1}{c |}{space 1}{ralign 18:{res:{sf:          -48.5054}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -9.5254}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            4.3228}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnMORT}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            2.1944}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.2661}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            2.6691}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:SCHOOL}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.2351}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.9782}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           91.5849}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:lnCRIME}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -2.4198}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.2955}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            2.6884}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:ENERGY}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.1371}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.6069}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           97.4154}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:LITERACY}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -1.5898}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -7.1265}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           98.6714}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:TAX}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.0992}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.2097}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           46.5455}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:LEGAL}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            1.4096}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            0.2969}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:            4.6364}}}{space 1}{c |}
{space 0}{c |}{space 1}{ralign 10:EASE}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -0.8627}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           -2.3943}}}{space 1}{c |}{space 1}{ralign 18:{res:{sf:           61.0961}}}{space 1}{c |}
{space 0}{c BLC}{hline 12}{c  BT}{hline 20}{c  BT}{hline 20}{c  BT}{hline 20}{c BRC}
 Mean of Dependent Variable ={res}{col 30}     22.0125

{com}. 
. * The Farrar – Glauber (F.G.) test is considered to be the best examination of multicollinearity. The F.G. test consists of three part: a determinant test, a multicollinearity F-test, and a multicollinearity T-test. In the first test, if the determinant of the correlation matrix for our independent variables is zero, there is undeniable multicollinearity. This is the case. To explain, in case of perfect multicollinearity the simple correlation coefficients are 1 to unity and so the above determinant turns to zero. That is, a matrix of all ones is going to equate to a determinate of 0, and the system of equations associated with it is linearly dependent. Now on the other hand, in case of orthogonality (statistical independence) of the explanatory variables the simple correlation coefficients are all equal to zero and so the standardized determinant turns to unity. That is, the determinant is 1. 

. 
. * In the second test, we are essentially testing for the statistical significance of these multiple correlation coefficients using an F test. What we find here is that for the vif and F-test value, they are the highest at lnLIFE which implies a high degree of explanatory correlation between its effect and the lnMORT effect on FDI. This is also the case with GINI and POVERTY and LIFE and EASE, as reinforced by the third test as well. At the third part of the testing, the partial correlation determined by the T-test value is at its highest, implying the greatest satistical signficance, when "lnMORT" is paired with "lnLIFE", and "GINI" is paired with "POVERTY". 

. 
. * Given the ridge regression test results, I will be eliminating one variable from each of these three correlated pairs. I choose POVERTY ovr GINI because I believe GINI has less explanatory power on our dependent variable; I choose EASE over LEGAL for that very same reason, and I chose lnLIFE over lnMORT because life expectancy is part of the calculation of the HDI Index while lnMORT is not. 

. * Really we can go about many ways of running a regression with these different control variables, as long as they don't correlate with each other to a large degree. 

. 
. reg lnFDI lnGDP lnLIFE SCHOOL EXCHANGE TAX EASE POVERTY lnCRIME, r

{txt}Linear regression                               Number of obs     = {res}        32
                                                {txt}F(8, 23)          =  {res}    67.40
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8932
                                                {txt}Root MSE          =    {res} .66111

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9385876{col 26}{space 2} .0902803{col 37}{space 1}   10.40{col 46}{space 3}0.000{col 54}{space 4} .7518286{col 67}{space 3} 1.125347
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 5.988063{col 26}{space 2} 7.556003{col 37}{space 1}    0.79{col 46}{space 3}0.436{col 54}{space 4} -9.64272{col 67}{space 3} 21.61885
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .0300387{col 26}{space 2} .0440349{col 37}{space 1}    0.68{col 46}{space 3}0.502{col 54}{space 4}-.0610544{col 67}{space 3} .1211318
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2} .0002995{col 26}{space 2} .0009887{col 37}{space 1}    0.30{col 46}{space 3}0.765{col 54}{space 4}-.0017457{col 67}{space 3} .0023448
{txt}{space 9}TAX {c |}{col 14}{res}{space 2}-.0037873{col 26}{space 2}  .010398{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.0252972{col 67}{space 3} .0177227
{txt}{space 8}EASE {c |}{col 14}{res}{space 2} .0265714{col 26}{space 2} .0274358{col 37}{space 1}    0.97{col 46}{space 3}0.343{col 54}{space 4}-.0301839{col 67}{space 3} .0833267
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2} .0481184{col 26}{space 2} .0382595{col 37}{space 1}    1.26{col 46}{space 3}0.221{col 54}{space 4}-.0310273{col 67}{space 3} .1272642
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2} .2922773{col 26}{space 2} .1574253{col 37}{space 1}    1.86{col 46}{space 3}0.076{col 54}{space 4}-.0333817{col 67}{space 3} .6179363
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-33.05235{col 26}{space 2} 29.08314{col 37}{space 1}   -1.14{col 46}{space 3}0.267{col 54}{space 4}-93.21541{col 67}{space 3} 27.11071
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 6}SCHOOL {c |} {res}     5.05    0.197947
{txt}{space 6}lnLIFE {c |} {res}     3.42    0.292317
{txt}{space 8}EASE {c |} {res}     3.03    0.329800
{txt}{space 5}POVERTY {c |} {res}     2.84    0.351924
{txt}{space 7}lnGDP {c |} {res}     2.36    0.424331
{txt}{space 4}EXCHANGE {c |} {res}     2.18    0.457961
{txt}{space 9}TAX {c |} {res}     2.00    0.499161
{txt}{space 5}lnCRIME {c |} {res}     1.67    0.597214
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     2.82

{com}. * Notice how our regression still, however, lacks statistical signficance. Given that the vif value is at its highest at the variable SCHOOL, at 5.05, we can eliminate it as it seems to be still somewhat correlated with the other variables. 

. 
. ssc install outreg2
{txt}checking {hilite:outreg2} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. * The outreg2 package allows us to examine different varieties of regression tables. 

. * I don't control for lnCRIME in any of these estimators because I believe it is best saved as an estimator for until after we control for fixed-effects. 

. reg lnFDI lnGDP lnMORT EXCHANGE EASE, r

{txt}Linear regression                               Number of obs     = {res}       104
                                                {txt}F(4, 99)          =  {res}   417.90
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.9133
                                                {txt}Root MSE          =    {res} .68126

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .8161192{col 26}{space 2} .0360673{col 37}{space 1}   22.63{col 46}{space 3}0.000{col 54}{space 4} .7445538{col 67}{space 3} .8876846
{txt}{space 6}lnMORT {c |}{col 14}{res}{space 2}-.3289642{col 26}{space 2} .1545582{col 37}{space 1}   -2.13{col 46}{space 3}0.036{col 54}{space 4}-.6356413{col 67}{space 3}-.0222871
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0001506{col 26}{space 2} .0000236{col 37}{space 1}   -6.37{col 46}{space 3}0.000{col 54}{space 4}-.0001975{col 67}{space 3}-.0001037
{txt}{space 8}EASE {c |}{col 14}{res}{space 2}  .018888{col 26}{space 2} .0113562{col 37}{space 1}    1.66{col 46}{space 3}0.099{col 54}{space 4}-.0036451{col 67}{space 3} .0414211
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9222469{col 26}{space 2} .8334322{col 37}{space 1}    1.11{col 46}{space 3}0.271{col 54}{space 4}-.7314635{col 67}{space 3} 2.575957
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. est store model1

. * In this model, with every 1% increase in GDP there is going to be roughly a .816% increase in FDI. With every 1 currency unit increase in LCU with regards to USD, FDI will go down by -.00015%; this signfies that FDI has a negative impact on a depreciating currency. A 1% change in the infant mortality rate, will signal roughly a -.330% decrease in FDI. Lastly, as the ease of conducting business index increases by 1 unit, there will be a predicted .01889% increase in FDI. 

. reg lnFDI lnGDP lnLIFE LEGAL GINI EXCHANGE TAX, r

{txt}Linear regression                               Number of obs     = {res}        80
                                                {txt}F(6, 73)          =  {res}   330.88
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8991
                                                {txt}Root MSE          =    {res} .56094

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .884213{col 26}{space 2} .0283524{col 37}{space 1}   31.19{col 46}{space 3}0.000{col 54}{space 4} .8277067{col 67}{space 3} .9407192
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 6.064812{col 26}{space 2}  2.04594{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} 1.987258{col 67}{space 3} 10.14237
{txt}{space 7}LEGAL {c |}{col 14}{res}{space 2}  .051601{col 26}{space 2} .0249739{col 37}{space 1}    2.07{col 46}{space 3}0.042{col 54}{space 4} .0018281{col 67}{space 3} .1013738
{txt}{space 8}GINI {c |}{col 14}{res}{space 2} .0802148{col 26}{space 2} .0115605{col 37}{space 1}    6.94{col 46}{space 3}0.000{col 54}{space 4} .0571748{col 67}{space 3} .1032547
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0001732{col 26}{space 2} .0000388{col 37}{space 1}   -4.47{col 46}{space 3}0.000{col 54}{space 4}-.0002504{col 67}{space 3}-.0000959
{txt}{space 9}TAX {c |}{col 14}{res}{space 2}-.0006723{col 26}{space 2}  .003876{col 37}{space 1}   -0.17{col 46}{space 3}0.863{col 54}{space 4}-.0083971{col 67}{space 3} .0070526
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-30.64201{col 26}{space 2} 8.479767{col 37}{space 1}   -3.61{col 46}{space 3}0.001{col 54}{space 4}-47.54216{col 67}{space 3}-13.74186
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. est store model2

. * In this model, I use lnLIFE instead of lnMORT and LEGAL instead of EASE; I also add in a tax and Gini variable condition. A 1% increase in GDP is associated with roughly a .884% increase in FDI. A 1% change in the life expectancy of citizens within a country is associated with a 6.06% increase in FDI. As the legal rights index increases by 1 unit, FDI will increase by .052%. For every 1% increase in the Gini index there will be roughly a .08% increase in FDI. With every 1 currency unit increase in LCU with regards to USD, FDI will go down by -.00017%. Lastly, our only non-statistically signficant varibale, TAX, predicts that for every 1% increase in tax rate, as a % of total profit, FDI will decrease by -.000067%. 

. reg lnFDI lnGDP lnLIFE EXCHANGE POVERTY EASE TAX, r

{txt}Linear regression                               Number of obs     = {res}        51
                                                {txt}F(6, 44)          =  {res}    83.11
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8917
                                                {txt}Root MSE          =    {res} .59349

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9482891{col 26}{space 2} .0696896{col 37}{space 1}   13.61{col 46}{space 3}0.000{col 54}{space 4} .8078389{col 67}{space 3} 1.088739
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.246734{col 26}{space 2} 2.841576{col 37}{space 1}    2.55{col 46}{space 3}0.014{col 54}{space 4} 1.519913{col 67}{space 3} 12.97355
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0000984{col 26}{space 2} .0000425{col 37}{space 1}   -2.32{col 46}{space 3}0.025{col 54}{space 4}-.0001841{col 67}{space 3}-.0000128
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2} .0505309{col 26}{space 2} .0162842{col 37}{space 1}    3.10{col 46}{space 3}0.003{col 54}{space 4} .0177123{col 67}{space 3} .0833495
{txt}{space 8}EASE {c |}{col 14}{res}{space 2} .0306145{col 26}{space 2} .0253688{col 37}{space 1}    1.21{col 46}{space 3}0.234{col 54}{space 4}-.0205129{col 67}{space 3} .0817419
{txt}{space 9}TAX {c |}{col 14}{res}{space 2}-.0020277{col 26}{space 2} .0068558{col 37}{space 1}   -0.30{col 46}{space 3}0.769{col 54}{space 4}-.0158448{col 67}{space 3} .0117893
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-35.51824{col 26}{space 2} 11.44653{col 37}{space 1}   -3.10{col 46}{space 3}0.003{col 54}{space 4}-58.58719{col 67}{space 3}-12.44928
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. est store model3

. * In this model I use EASE instead of LEGAL, and POVERTY instead of GINI. For every 1% increase in GDP, there will be roughly a .948% increase in FDI. For every 1% increase in life expectancy there will be a 7.25% increase in FDI. With every 1 currency unit increase in LCU with regards to USD, FDI will go down by -.00010%. For every 1% increase in tax rate, as a % of total profit, FDI will decrease by -.00203% (this is still a statistically insignificant variable). For every 1 increase in the ease of doing business index, there will be roughly a .031% in FDI (this variable is now statistically insignificant, probably as a result of the tax condition being added). Lastly, for every 1% increase in the population living under extreme poverty, there will be roughly a .051% increase in FDI. This doesn’t seem to make any sense, and when we factor in fixed effects, we will see that this variable is no longer statistically significant. 

. 
. outreg2 [model1 model2 model3] using tableOLS, word replace dec(5) label symbol(***,**,*,---) alpha(.01,0.05,0.1,.15)
{txt}{stata `"shellout using `"tableOLS.rtf"'"':tableOLS.rtf}
{browse `"/Users/patrickpoleshuk"' :dir}{com} : {txt}{stata `"seeout using "tableOLS.txt", label"':seeout}

{com}. * Here is the completed OLS table of effect estimators on FDI. We can see that TAX is the only variable which is insignificant in both cases where it is presented, I will try to determine if it's useful the following regression. 

. 
. ssc install elasticregress
{txt}checking {hilite:elasticregress} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. * I will also be using an elastic-net regression to see if any other of my variables are extraneous. 

. * An elastic-net regression applies both the constraints of the ridge regression and LASSO (least absolute shrinkage and selection operator) on our OLS estimate. By itself LASSO regression tends to shrink all correlated terms to 0 and pick only one of the correlated parameters. Ridge regression, as we've seen, tends to shrink all of the parameters for the correlated variables together. It is introducing a bias to account for a better OLS prediction. In elastic-net regression we will be shrinking all the parameters associated with the correlated variables and shrinking any coefficents to 0 if they are not pertinent to the regression. Thus, it does the best job of dealing with correlated coefficents on our dependent variable. 

. 
. elasticregress lnFDI lnGDP POVERTY EXCHANGE lnLIFE TAX EASE
{res}Warning: the smallest λ tested was the MSE-minimising λ.
Consider re-running estimation with a smaller epsilon.

{txt}Elastic-net regression{col 40}Number of observations{col 67}= {res}        50
{col 40}{txt}R-squared{col 67}= {res}    0.8892
{col 40}{txt}alpha{col 67}= {res}    0.8000
{col 40}{txt}lambda{col 67}= {res}    0.0410
{col 40}{txt}Cross-validation MSE{col 67}= {res}    0.4495
{col 40}{txt}Number of folds{col 67}= {res}        10
{col 40}{txt}Number of alpha tested{col 67}= {res}         6
{col 40}{txt}Number of lambda tested{col 67}= {res}       100
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9078091
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2}  .037694
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0000858
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2}  6.73236
{txt}{space 9}TAX {c |}{col 14}{res}{space 2}        0
{txt}{space 8}EASE {c |}{col 14}{res}{space 2}  .029584
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-32.26418
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. * asdoc elasticregress lnFDI lnGDP POVERTY EXCHANGE lnLIFE TAX EASE, append

. * There are no statistically significance notifications for my coefficents, given that, in elastic-net regressions, we are putting a regularization on our coefficents and already shrinking non-significant values to zero. Any non-zero effect in our coefficents, as seen for all of them except TAX, implies that they are alreay statistically significant. While it might seem bizarre that we have a positive effect coefficent for POVERTY, we will be controlling for yearly fixed effects in our panel data which attempts to provide a more accurate reading of our coefficents later on. 

. 
. * The alpha in this equation is the degree of mixing between the LASSO and Ridge characteristics. Given that none of my variables can really be considered "useless" the ridge regression would be more applicable for my data. Indeed, if alpha = 1 than the elastic-net is mostly made of the ridge parameter added bias, while if lambda is equal to 1 than the regression is primarly concerned with shrinking any correlated coefficents to 0. This elastic-net shares more characteristics with the ridge regression than the LASSO, as the alpha value is .4. Yet, we can see that the shrinkage parameter, lambda, is .0819, and we had SCHOOL shrunk down. 

. 
. reg lnFDI lnGDP EXCHANGE POVERTY lnLIFE EASE, r

{txt}Linear regression                               Number of obs     = {res}        51
                                                {txt}F(5, 45)          =  {res}    99.25
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8913
                                                {txt}Root MSE          =    {res} .58782

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9367251{col 26}{space 2} .0639666{col 37}{space 1}   14.64{col 46}{space 3}0.000{col 54}{space 4} .8078897{col 67}{space 3}  1.06556
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0000924{col 26}{space 2} .0000322{col 37}{space 1}   -2.87{col 46}{space 3}0.006{col 54}{space 4}-.0001573{col 67}{space 3}-.0000275
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2} .0524122{col 26}{space 2} .0144319{col 37}{space 1}    3.63{col 46}{space 3}0.001{col 54}{space 4}  .023345{col 67}{space 3} .0814795
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.289742{col 26}{space 2} 2.851997{col 37}{space 1}    2.56{col 46}{space 3}0.014{col 54}{space 4} 1.545525{col 67}{space 3} 13.03396
{txt}{space 8}EASE {c |}{col 14}{res}{space 2} .0342552{col 26}{space 2} .0187815{col 37}{space 1}    1.82{col 46}{space 3}0.075{col 54}{space 4}-.0035728{col 67}{space 3} .0720831
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -35.7446{col 26}{space 2} 11.58237{col 37}{space 1}   -3.09{col 46}{space 3}0.003{col 54}{space 4}-59.07268{col 67}{space 3}-12.41652
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. * Currently we are left with this regression, where are arn't lacking any major statistical signficance. However, I will attempt to make my estimators more precise, going into my time series analysis. 

. 
. * While I've made sure to control for multicollinearity, insignificant coefficents, and eliminate variables with small samples, I haven't controlled for the possibility of unobserved heterogeneity as with time-invariant unobserved individual characteristics, across countries and years, that can be correlated with our current independent variables.

. * It is generally always important to control for year effects in our regression, as it takes into account aggregate rising trends that would either inflate or deflate our coefficent of effects on our explanatory variables.

. * First however, we need to determine whether we will be using random effects or fixed effects regression. I have a feeling we will be using fixed effects, but we can test for this in the following lines. 

. 
. gen lnEXCHANGE = ln(EXCHANGE)
{txt}(115 missing values generated)

{com}. * I found that the standard EXCHANGE varibale is best under a standard OLS estimator, as taking the log of this rate introduces weak statistical signficance. I theorize that this might be because without controlling for fixed effects, we arn't taking into account the lagged effects of the exchange rates on FDI. In other words, investors won't respond to a 1% increase or decrease in exchange rate appreciation immediately. They will take some time to alter their FDI in response to this change, so the standard OLS estimate will better pick up a 1 unit appreciation or depreciation in LCU against the USD rather than a 1% increase or decrease.

. egen countryname1 = group(country)

. xtset countryname1 year, yearly
{res}{txt}{col 8}panel variable:  {res}countryname1 (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1960 to 2018
{txt}{col 17}delta:  {res}1 year

{com}. xtreg lnFDI lnGDP lnEXCHANGE lnLIFE lnCRIME, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       525
{txt}Group variable: {res}countryname1{txt}{col 49}Number of groups{col 67}={col 69}{res}        27

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.6055{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.9111{col 63}{txt}avg{col 67}={col 69}{res}      19.4
{txt}     overall = {res}0.8419{col 63}{txt}max{col 67}={col 69}{res}        28

{txt}{col 49}F({res}4{txt},{res}494{txt}){col 67}={col 70}{res}   189.52
{txt}corr(u_i, Xb){col 16}= {res}-0.7709{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.124867{col 26}{space 2} .1165294{col 37}{space 1}    9.65{col 46}{space 3}0.000{col 54}{space 4} .8959128{col 67}{space 3} 1.353821
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1994533{col 26}{space 2} .0245831{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .1511529{col 67}{space 3} .2477537
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.530122{col 26}{space 2} 2.422705{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 2.770045{col 67}{space 3}  12.2902
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-.1584598{col 26}{space 2} .0998131{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.3545703{col 67}{space 3} .0376508
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-38.78337{col 26}{space 2} 8.082949{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-54.66457{col 67}{space 3}-22.90218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0917049
     {txt}sigma_e {c |} {res} .66242227
         {txt}rho {c |} {res} .73089836{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}26{txt}, {res}494{txt}) = {res}15.39{col 62}{txt}Prob > F = {res}0.0000

{com}. est store fe

. 
. xtreg lnFDI lnGDP lnEXCHANGE lnLIFE lnCRIME, re
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}       525
{txt}Group variable: {res}countryname1                    {txt}Number of groups  = {res}        27

{txt}R-sq:                                           Obs per group:
     within  = {res}0.6009                                         {txt}min = {res}         1
{txt}     between = {res}0.9066                                         {txt}avg = {res}      19.4
{txt}     overall = {res}0.8407                                         {txt}max = {res}        28

                                                {txt}Wald chi2({res}4{txt})      =  {res}  1040.05
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .8657756{col 26}{space 2} .0431499{col 37}{space 1}   20.06{col 46}{space 3}0.000{col 54}{space 4} .7812032{col 67}{space 3} .9503479
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1516093{col 26}{space 2} .0225311{col 37}{space 1}    6.73{col 46}{space 3}0.000{col 54}{space 4} .1074493{col 67}{space 3} .1957694
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 10.03476{col 26}{space 2} 1.265699{col 37}{space 1}    7.93{col 46}{space 3}0.000{col 54}{space 4} 7.554035{col 67}{space 3} 12.51548
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2} .0029772{col 26}{space 2} .0819917{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-.1577236{col 67}{space 3} .1636779
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-43.63312{col 26}{space 2} 4.904643{col 37}{space 1}   -8.90{col 46}{space 3}0.000{col 54}{space 4}-53.24605{col 67}{space 3} -34.0202
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .48322596
     {txt}sigma_e {c |} {res} .66242227
         {txt}rho {c |} {res} .34732061{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est store re

. 
. hausman fe re

{txt}{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}     fe     {col 30}     re     {col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 7}lnGDP {c |}{res}{col 18} 1.124867{col 31} .8657756{col 47} .2590916{col 63} .1082459
{txt}{space 2}lnEXCHANGE {c |}{res}{col 18} .1994533{col 31} .1516093{col 47}  .047844{col 63} .0098327
{txt}{space 6}lnLIFE {c |}{res}{col 18} 7.530122{col 31} 10.03476{col 47}-2.504637{col 63} 2.065795
{txt}{space 5}lnCRIME {c |}{res}{col 18}-.1584598{col 31} .0029772{col 47}-.1614369{col 63} .0569212
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from xtreg}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from xtreg}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:4})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}     57.60
{txt}{col 17}Prob>chi2 =  {res}    0.0000

{com}. 
. * Notice that I eliminated the variable EASE, given that there are very little observations and for time series analysis we need to analyze variables for each given year. There was simply not enough observations under EASE, nevertheless we can see that, under the Hausman test we can reject the null hypothesis that we will be using a random effects model. 

. xtreg lnFDI lnGDP lnEXCHANGE lnLIFE lnCRIME POVERTY
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}       254
{txt}Group variable: {res}countryname1                    {txt}Number of groups  = {res}        20

{txt}R-sq:                                           Obs per group:
     within  = {res}0.6496                                         {txt}min = {res}         1
{txt}     between = {res}0.8696                                         {txt}avg = {res}      12.7
{txt}     overall = {res}0.7796                                         {txt}max = {res}        28

                                                {txt}Wald chi2({res}5{txt})      =  {res}   522.30
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  1.00126{col 26}{space 2} .0750433{col 37}{space 1}   13.34{col 46}{space 3}0.000{col 54}{space 4} .8541778{col 67}{space 3} 1.148342
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1714499{col 26}{space 2}  .031137{col 37}{space 1}    5.51{col 46}{space 3}0.000{col 54}{space 4} .1104224{col 67}{space 3} .2324773
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 10.25422{col 26}{space 2} 2.665926{col 37}{space 1}    3.85{col 46}{space 3}0.000{col 54}{space 4} 5.029097{col 67}{space 3} 15.47934
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2} .0800031{col 26}{space 2} .1173137{col 37}{space 1}    0.68{col 46}{space 3}0.495{col 54}{space 4}-.1499275{col 67}{space 3} .3099336
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2} .0337437{col 26}{space 2} .0130567{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4}  .008153{col 67}{space 3} .0593344
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-48.51458{col 26}{space 2} 10.76586{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-69.61528{col 67}{space 3}-27.41388
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .58228463
     {txt}sigma_e {c |} {res} .58669875
         {txt}rho {c |} {res} .49622402{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. * We get weak statistical signficance for lnCRIME which I believe to be contributed to the POVERTY variable. Given that POVERTY has a positive effect on FDI, I feel that it is also best eliminated.  

. xtreg lnFDI lnGDP lnLIFE lnEXCHANGE lnCRIME, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       525
{txt}Group variable: {res}countryname1{txt}{col 49}Number of groups{col 67}={col 69}{res}        27

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.6055{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.9111{col 63}{txt}avg{col 67}={col 69}{res}      19.4
{txt}     overall = {res}0.8419{col 63}{txt}max{col 67}={col 69}{res}        28

{txt}{col 49}F({res}4{txt},{res}494{txt}){col 67}={col 70}{res}   189.52
{txt}corr(u_i, Xb){col 16}= {res}-0.7709{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.124867{col 26}{space 2} .1165294{col 37}{space 1}    9.65{col 46}{space 3}0.000{col 54}{space 4} .8959128{col 67}{space 3} 1.353821
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.530122{col 26}{space 2} 2.422705{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 2.770045{col 67}{space 3}  12.2902
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1994533{col 26}{space 2} .0245831{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .1511529{col 67}{space 3} .2477537
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-.1584598{col 26}{space 2} .0998131{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.3545703{col 67}{space 3} .0376508
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-38.78337{col 26}{space 2} 8.082949{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-54.66457{col 67}{space 3}-22.90218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0917049
     {txt}sigma_e {c |} {res} .66242227
         {txt}rho {c |} {res} .73089836{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}26{txt}, {res}494{txt}) = {res}15.39{col 62}{txt}Prob > F = {res}0.0000

{com}. * This is the ideal regression estimator. It might appear a little bizzare that lnEXCHANGE now has a positive effect on FDI, however, after controlling for yearly fixed effects, it would make sense that foreign investors would prefer a country whose currency is already constantly in demand, as a higher demand for a country's currency signals that the value of their goods on the world market may be higher than before.  

. xtreg lnFDI lnGDP lnEXCHANGE lnLIFE lnCRIME, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       525
{txt}Group variable: {res}countryname1{txt}{col 49}Number of groups{col 67}={col 69}{res}        27

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.6055{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.9111{col 63}{txt}avg{col 67}={col 69}{res}      19.4
{txt}     overall = {res}0.8419{col 63}{txt}max{col 67}={col 69}{res}        28

{txt}{col 49}F({res}4{txt},{res}494{txt}){col 67}={col 70}{res}   189.52
{txt}corr(u_i, Xb){col 16}= {res}-0.7709{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.124867{col 26}{space 2} .1165294{col 37}{space 1}    9.65{col 46}{space 3}0.000{col 54}{space 4} .8959128{col 67}{space 3} 1.353821
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1994533{col 26}{space 2} .0245831{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .1511529{col 67}{space 3} .2477537
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.530122{col 26}{space 2} 2.422705{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 2.770045{col 67}{space 3}  12.2902
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-.1584598{col 26}{space 2} .0998131{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.3545703{col 67}{space 3} .0376508
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-38.78337{col 26}{space 2} 8.082949{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-54.66457{col 67}{space 3}-22.90218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0917049
     {txt}sigma_e {c |} {res} .66242227
         {txt}rho {c |} {res} .73089836{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}26{txt}, {res}494{txt}) = {res}15.39{col 62}{txt}Prob > F = {res}0.0000

{com}. * asdoc xtreg lnFDI lnGDP lnEXCHANGE lnLIFE lnCRIME, fe

. * With our new model controlling for fixed effects, we use the "within" r^2 value which is .6055. Notice how the coefficient of effects have changed somewhat significantly. 
. * Additionally, if I had strong belief that my regression suffered from reverse causality. Essentially, an increasing FDI would cause a greater GDP to be produced, as with the worry that a continuous increase in FDI would lead to an increase in GDP, then I could use instrumental variables. However, for now, I am more worried about Foreign Direct Investment taking off and injecting the economy with new growth, not detected under standard OLS predictions. I believe fixed effects is the best way to control for this. 

. 
. * In these loops I will try to provide evidence of varying effects in my variables throughout various years. 

. gen t = _n

. * Here I am numbering each row of cells. 

. ssc install coefplot
{txt}checking {hilite:coefplot} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. foreach i of num 1122/1180{c -(}
{txt}  2{com}. reg lnFDI lnGDP if t>`i' & t<`i' + 1180
{txt}  3{com}. est store reg_`i'
{txt}  4{com}.  {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       381
{txt}{hline 13}{c +}{hline 34}   F(1, 379)       = {res}  1378.33
{txt}       Model {c |} {res} 2686.14247         1  2686.14247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.608113       379  1.94883407   {txt}R-squared       ={res}    0.7843
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.75058       380  9.01250153   {txt}Root MSE        =   {res}  1.396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987347{col 26}{space 2} .0269013{col 37}{space 1}   37.13{col 46}{space 3}0.000{col 54}{space 4} .9458402{col 67}{space 3} 1.051629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170829{col 26}{space 2}  .655834{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-5.460358{col 67}{space 3}  -2.8813
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       380
{txt}{hline 13}{c +}{hline 34}   F(1, 378)       = {res}  1375.26
{txt}       Model {c |} {res} 2686.20241         1  2686.20241   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 738.323344       378  1.95323636   {txt}R-squared       ={res}    0.7844
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3424.52576       379  9.03568801   {txt}Root MSE        =   {res} 1.3976

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987465{col 26}{space 2} .0269317{col 37}{space 1}   37.08{col 46}{space 3}0.000{col 54}{space 4} .9457918{col 67}{space 3} 1.051701
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.169713{col 26}{space 2} .6565808{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-5.460721{col 67}{space 3}-2.878704
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       379
{txt}{hline 13}{c +}{hline 34}   F(1, 377)       = {res}  1372.50
{txt}       Model {c |} {res} 2686.38312         1  2686.38312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 737.900642       377  1.95729613   {txt}R-squared       ={res}    0.7845
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7839
{txt}       Total {c |} {res} 3424.28376       378  9.05895176   {txt}Root MSE        =   {res}  1.399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9987847{col 26}{space 2} .0269598{col 37}{space 1}   37.05{col 46}{space 3}0.000{col 54}{space 4} .9457744{col 67}{space 3} 1.051795
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.168927{col 26}{space 2}  .657265{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.461291{col 67}{space 3}-2.876562
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       378
{txt}{hline 13}{c +}{hline 34}   F(1, 376)       = {res}  1372.55
{txt}       Model {c |} {res} 2687.09819         1  2687.09819   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 736.110519       376  1.95774074   {txt}R-squared       ={res}    0.7850
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7844
{txt}       Total {c |} {res} 3423.20871       377   9.0801292   {txt}Root MSE        =   {res} 1.3992

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9989345{col 26}{space 2} .0269633{col 37}{space 1}   37.05{col 46}{space 3}0.000{col 54}{space 4} .9459168{col 67}{space 3} 1.051952
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.169021{col 26}{space 2} .6573397{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.461544{col 67}{space 3}-2.876499
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       377
{txt}{hline 13}{c +}{hline 34}   F(1, 375)       = {res}  1369.75
{txt}       Model {c |} {res} 2687.44978         1  2687.44978   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 735.749401       375   1.9619984   {txt}R-squared       ={res}    0.7851
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7845
{txt}       Total {c |} {res} 3423.19918       376  9.10425314   {txt}Root MSE        =   {res} 1.4007

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9990469{col 26}{space 2} .0269939{col 37}{space 1}   37.01{col 46}{space 3}0.000{col 54}{space 4} .9459686{col 67}{space 3} 1.052125
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.170154{col 26}{space 2} .6580594{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.464103{col 67}{space 3}-2.876205
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       376
{txt}{hline 13}{c +}{hline 34}   F(1, 374)       = {res}  1367.46
{txt}       Model {c |} {res} 2688.02662         1  2688.02662   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 735.172465       374  1.96570178   {txt}R-squared       ={res}    0.7852
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7847
{txt}       Total {c |} {res} 3423.19909       375   9.1285309   {txt}Root MSE        =   {res}  1.402

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9992641{col 26}{space 2} .0270223{col 37}{space 1}   36.98{col 46}{space 3}0.000{col 54}{space 4} .9461294{col 67}{space 3} 1.052399
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.173399{col 26}{space 2} .6587073{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.468633{col 67}{space 3}-2.878164
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       375
{txt}{hline 13}{c +}{hline 34}   F(1, 373)       = {res}  1366.50
{txt}       Model {c |} {res} 2689.15611         1  2689.15611   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 734.033997       373  1.96791956   {txt}R-squared       ={res}    0.7856
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7850
{txt}       Total {c |} {res} 3423.19011       374  9.15291473   {txt}Root MSE        =   {res} 1.4028

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9996497{col 26}{space 2} .0270423{col 37}{space 1}   36.97{col 46}{space 3}0.000{col 54}{space 4} .9464753{col 67}{space 3} 1.052824
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  -4.1799{col 26}{space 2} .6591343{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.475985{col 67}{space 3}-2.883815
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       374
{txt}{hline 13}{c +}{hline 34}   F(1, 372)       = {res}  1363.65
{txt}       Model {c |} {res} 2689.39389         1  2689.39389   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 733.657183       372  1.97219673   {txt}R-squared       ={res}    0.7857
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7851
{txt}       Total {c |} {res} 3423.05107       373  9.17708062   {txt}Root MSE        =   {res} 1.4043

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9998749{col 26}{space 2} .0270766{col 37}{space 1}   36.93{col 46}{space 3}0.000{col 54}{space 4} .9466326{col 67}{space 3} 1.053117
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.183716{col 26}{space 2} .6599079{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.481333{col 67}{space 3}-2.886098
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       373
{txt}{hline 13}{c +}{hline 34}   F(1, 371)       = {res}  1364.12
{txt}       Model {c |} {res} 2690.99505         1  2690.99505   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 731.869437       371   1.9726939   {txt}R-squared       ={res}    0.7862
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7856
{txt}       Total {c |} {res} 3422.86448       372  9.20124861   {txt}Root MSE        =   {res} 1.4045

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.000325{col 26}{space 2} .0270841{col 37}{space 1}   36.93{col 46}{space 3}0.000{col 54}{space 4} .9470672{col 67}{space 3} 1.053582
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.191034{col 26}{space 2} .6600359{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-5.488914{col 67}{space 3}-2.893153
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       372
{txt}{hline 13}{c +}{hline 34}   F(1, 370)       = {res}  1362.19
{txt}       Model {c |} {res} 2691.67499         1  2691.67499   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 731.118207       370  1.97599516   {txt}R-squared       ={res}    0.7864
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7858
{txt}       Total {c |} {res} 3422.79319       371  9.22585766   {txt}Root MSE        =   {res} 1.4057

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  1.00069{col 26}{space 2} .0271132{col 37}{space 1}   36.91{col 46}{space 3}0.000{col 54}{space 4} .9473748{col 67}{space 3} 1.054005
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.197555{col 26}{space 2} .6606725{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-5.496699{col 67}{space 3}-2.898411
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       371
{txt}{hline 13}{c +}{hline 34}   F(1, 369)       = {res}  1358.48
{txt}       Model {c |} {res} 2690.91727         1  2690.91727   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.927922       369  1.98083448   {txt}R-squared       ={res}    0.7864
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7858
{txt}       Total {c |} {res} 3421.84519       370  9.24823025   {txt}Root MSE        =   {res} 1.4074

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.000919{col 26}{space 2} .0271564{col 37}{space 1}   36.86{col 46}{space 3}0.000{col 54}{space 4}  .947518{col 67}{space 3}  1.05432
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.201919{col 26}{space 2} .6616309{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-5.502959{col 67}{space 3}-2.900879
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       370
{txt}{hline 13}{c +}{hline 34}   F(1, 368)       = {res}  1354.16
{txt}       Model {c |} {res} 2689.04744         1  2689.04744   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.760359       368  1.98576184   {txt}R-squared       ={res}    0.7863
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7857
{txt}       Total {c |} {res}  3419.8078       369  9.26777182   {txt}Root MSE        =   {res} 1.4092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001199{col 26}{space 2} .0272072{col 37}{space 1}   36.80{col 46}{space 3}0.000{col 54}{space 4} .9476974{col 67}{space 3}   1.0547
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.207588{col 26}{space 2} .6627408{col 37}{space 1}   -6.35{col 46}{space 3}0.000{col 54}{space 4}-5.510822{col 67}{space 3}-2.904354
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       369
{txt}{hline 13}{c +}{hline 34}   F(1, 367)       = {res}  1349.00
{txt}       Model {c |} {res} 2685.81534         1  2685.81534   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.684156       367    1.990965   {txt}R-squared       ={res}    0.7861
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7855
{txt}       Total {c |} {res}  3416.4995       368  9.28396602   {txt}Root MSE        =   {res}  1.411

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001414{col 26}{space 2} .0272651{col 37}{space 1}   36.73{col 46}{space 3}0.000{col 54}{space 4} .9477986{col 67}{space 3}  1.05503
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.212057{col 26}{space 2} .6640015{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.517782{col 67}{space 3}-2.906332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       368
{txt}{hline 13}{c +}{hline 34}   F(1, 366)       = {res}  1344.80
{txt}       Model {c |} {res} 2684.17738         1  2684.17738   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.523148       366  1.99596489   {txt}R-squared       ={res}    0.7861
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7855
{txt}       Total {c |} {res} 3414.70053       367   9.3043611   {txt}Root MSE        =   {res} 1.4128

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001675{col 26}{space 2} .0273148{col 37}{space 1}   36.67{col 46}{space 3}0.000{col 54}{space 4} .9479613{col 67}{space 3} 1.055388
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.21728{col 26}{space 2}  .665089{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-5.525156{col 67}{space 3}-2.909405
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       367
{txt}{hline 13}{c +}{hline 34}   F(1, 365)       = {res}  1340.04
{txt}       Model {c |} {res} 2681.97311         1  2681.97311   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.514662       365  2.00141003   {txt}R-squared       ={res}    0.7859
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7853
{txt}       Total {c |} {res} 3412.48777       366  9.32373707   {txt}Root MSE        =   {res} 1.4147

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001729{col 26}{space 2} .0273647{col 37}{space 1}   36.61{col 46}{space 3}0.000{col 54}{space 4} .9479169{col 67}{space 3} 1.055542
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.218344{col 26}{space 2}  .666196{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4}-5.528408{col 67}{space 3} -2.90828
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       366
{txt}{hline 13}{c +}{hline 34}   F(1, 364)       = {res}  1336.59
{txt}       Model {c |} {res}  2681.0482         1   2681.0482   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  730.14138       364  2.00588291   {txt}R-squared       ={res}    0.7860
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7854
{txt}       Total {c |} {res} 3411.18958       365  9.34572489   {txt}Root MSE        =   {res} 1.4163

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002129{col 26}{space 2} .0274109{col 37}{space 1}   36.56{col 46}{space 3}0.000{col 54}{space 4} .9482251{col 67}{space 3} 1.056033
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.226344{col 26}{space 2} .6671977{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4} -5.53839{col 67}{space 3}-2.914298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       365
{txt}{hline 13}{c +}{hline 34}   F(1, 363)       = {res}  1332.36
{txt}       Model {c |} {res} 2679.27795         1  2679.27795   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.965952       363  2.01092549   {txt}R-squared       ={res}    0.7859
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7853
{txt}       Total {c |} {res} 3409.24391       364  9.36605469   {txt}Root MSE        =   {res} 1.4181

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002413{col 26}{space 2} .0274622{col 37}{space 1}   36.50{col 46}{space 3}0.000{col 54}{space 4} .9484079{col 67}{space 3} 1.056418
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.232069{col 26}{space 2}  .668317{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4}-5.546328{col 67}{space 3} -2.91781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       364
{txt}{hline 13}{c +}{hline 34}   F(1, 362)       = {res}  1327.49
{txt}       Model {c |} {res} 2676.77277         1  2676.77277   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  729.94521       362  2.01642323   {txt}R-squared       ={res}    0.7857
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7851
{txt}       Total {c |} {res} 3406.71798       363  9.38489801   {txt}Root MSE        =   {res}   1.42

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002335{col 26}{space 2} .0275105{col 37}{space 1}   36.43{col 46}{space 3}0.000{col 54}{space 4} .9482346{col 67}{space 3} 1.056435
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.23058{col 26}{space 2}  .669391{col 37}{space 1}   -6.32{col 46}{space 3}0.000{col 54}{space 4}-5.546964{col 67}{space 3}-2.914197
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       363
{txt}{hline 13}{c +}{hline 34}   F(1, 361)       = {res}  1322.46
{txt}       Model {c |} {res} 2673.94838         1  2673.94838   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.924129       361  2.02195049   {txt}R-squared       ={res}    0.7856
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7850
{txt}       Total {c |} {res} 3403.87251       362  9.40296272   {txt}Root MSE        =   {res}  1.422

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002251{col 26}{space 2} .0275604{col 37}{space 1}   36.37{col 46}{space 3}0.000{col 54}{space 4}  .948052{col 67}{space 3}  1.05645
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.228952{col 26}{space 2} .6704974{col 37}{space 1}   -6.31{col 46}{space 3}0.000{col 54}{space 4}-5.547524{col 67}{space 3} -2.91038
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       362
{txt}{hline 13}{c +}{hline 34}   F(1, 360)       = {res}  1317.23
{txt}       Model {c |} {res} 2670.77864         1  2670.77864   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.923441       360  2.02756512   {txt}R-squared       ={res}    0.7854
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7848
{txt}       Total {c |} {res} 3400.70208       361  9.42022737   {txt}Root MSE        =   {res} 1.4239

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002234{col 26}{space 2} .0276145{col 37}{space 1}   36.29{col 46}{space 3}0.000{col 54}{space 4} .9479278{col 67}{space 3}  1.05654
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.228607{col 26}{space 2} .6716887{col 37}{space 1}   -6.30{col 46}{space 3}0.000{col 54}{space 4}-5.549534{col 67}{space 3}-2.907681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       361
{txt}{hline 13}{c +}{hline 34}   F(1, 359)       = {res}  1311.84
{txt}       Model {c |} {res} 2667.23789         1  2667.23789   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.917833       359  2.03319731   {txt}R-squared       ={res}    0.7851
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7845
{txt}       Total {c |} {res} 3397.15572       360  9.43654367   {txt}Root MSE        =   {res} 1.4259

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002289{col 26}{space 2} .0276727{col 37}{space 1}   36.22{col 46}{space 3}0.000{col 54}{space 4} .9478679{col 67}{space 3}  1.05671
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.229731{col 26}{space 2} .6729612{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-5.553172{col 67}{space 3} -2.90629
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       360
{txt}{hline 13}{c +}{hline 34}   F(1, 358)       = {res}  1307.19
{txt}       Model {c |} {res} 2664.52578         1  2664.52578   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.734317       358  2.03836401   {txt}R-squared       ={res}    0.7850
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7844
{txt}       Total {c |} {res} 3394.26009       359   9.4547635   {txt}Root MSE        =   {res} 1.4277

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002632{col 26}{space 2} .0277314{col 37}{space 1}   36.16{col 46}{space 3}0.000{col 54}{space 4} .9480951{col 67}{space 3} 1.057169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.236834{col 26}{space 2} .6742314{col 37}{space 1}   -6.28{col 46}{space 3}0.000{col 54}{space 4}-5.562786{col 67}{space 3}-2.910882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       359
{txt}{hline 13}{c +}{hline 34}   F(1, 357)       = {res}  1300.95
{txt}       Model {c |} {res}   2659.239         1    2659.239   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.733961       357  2.04407272   {txt}R-squared       ={res}    0.7847
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7841
{txt}       Total {c |} {res} 3388.97296       358  9.46640492   {txt}Root MSE        =   {res} 1.4297

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002649{col 26}{space 2} .0277983{col 37}{space 1}   36.07{col 46}{space 3}0.000{col 54}{space 4} .9479795{col 67}{space 3} 1.057318
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.23718{col 26}{space 2} .6756823{col 37}{space 1}   -6.27{col 46}{space 3}0.000{col 54}{space 4}-5.565998{col 67}{space 3}-2.908362
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       358
{txt}{hline 13}{c +}{hline 34}   F(1, 356)       = {res}  1295.03
{txt}       Model {c |} {res} 2654.35017         1  2654.35017   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  729.67207       356  2.04964065   {txt}R-squared       ={res}    0.7844
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7838
{txt}       Total {c |} {res} 3384.02224       357  9.47905389   {txt}Root MSE        =   {res} 1.4317

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002881{col 26}{space 2} .0278682{col 37}{space 1}   35.99{col 46}{space 3}0.000{col 54}{space 4} .9480738{col 67}{space 3} 1.057688
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.242096{col 26}{space 2} .6771931{col 37}{space 1}   -6.26{col 46}{space 3}0.000{col 54}{space 4}-5.573897{col 67}{space 3}-2.910294
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       357
{txt}{hline 13}{c +}{hline 34}   F(1, 355)       = {res}  1289.72
{txt}       Model {c |} {res} 2649.70541         1  2649.70541   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.342433       355  2.05448573   {txt}R-squared       ={res}    0.7842
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7835
{txt}       Total {c |} {res} 3379.04785       356  9.49170743   {txt}Root MSE        =   {res} 1.4333

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  1.00349{col 26}{space 2} .0279425{col 37}{space 1}   35.91{col 46}{space 3}0.000{col 54}{space 4} .9485362{col 67}{space 3} 1.058444
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.255195{col 26}{space 2} .6787813{col 37}{space 1}   -6.27{col 46}{space 3}0.000{col 54}{space 4}-5.590133{col 67}{space 3}-2.920257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       356
{txt}{hline 13}{c +}{hline 34}   F(1, 354)       = {res}  1281.44
{txt}       Model {c |} {res} 2639.83987         1  2639.83987   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 729.259203       354  2.06005424   {txt}R-squared       ={res}    0.7835
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7829
{txt}       Total {c |} {res} 3369.09908       355  9.49041993   {txt}Root MSE        =   {res} 1.4353

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.003176{col 26}{space 2} .0280238{col 37}{space 1}   35.80{col 46}{space 3}0.000{col 54}{space 4} .9480621{col 67}{space 3}  1.05829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.248434{col 26}{space 2} .6805322{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-5.586829{col 67}{space 3} -2.91004
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       355
{txt}{hline 13}{c +}{hline 34}   F(1, 353)       = {res}  1274.04
{txt}       Model {c |} {res} 2630.99451         1  2630.99451   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 728.975075       353   2.0650852   {txt}R-squared       ={res}    0.7830
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7824
{txt}       Total {c |} {res} 3359.96959       354  9.49143951   {txt}Root MSE        =   {res}  1.437

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002671{col 26}{space 2}  .028091{col 37}{space 1}   35.69{col 46}{space 3}0.000{col 54}{space 4} .9474246{col 67}{space 3} 1.057918
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.237754{col 26}{space 2} .6819708{col 37}{space 1}   -6.21{col 46}{space 3}0.000{col 54}{space 4}-5.578991{col 67}{space 3}-2.896517
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       354
{txt}{hline 13}{c +}{hline 34}   F(1, 352)       = {res}  1266.40
{txt}       Model {c |} {res} 2622.16738         1  2622.16738   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 728.840817       352   2.0705705   {txt}R-squared       ={res}    0.7825
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7819
{txt}       Total {c |} {res}  3351.0082       353  9.49294108   {txt}Root MSE        =   {res} 1.4389

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.002304{col 26}{space 2} .0281653{col 37}{space 1}   35.59{col 46}{space 3}0.000{col 54}{space 4} .9469106{col 67}{space 3} 1.057697
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.229926{col 26}{space 2} .6835677{col 37}{space 1}   -6.19{col 46}{space 3}0.000{col 54}{space 4}-5.574316{col 67}{space 3}-2.885535
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       353
{txt}{hline 13}{c +}{hline 34}   F(1, 351)       = {res}  1258.00
{txt}       Model {c |} {res} 2611.28999         1  2611.28999   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 728.585104       351  2.07574104   {txt}R-squared       ={res}    0.7819
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7812
{txt}       Total {c |} {res} 3339.87509       352   9.4882815   {txt}Root MSE        =   {res} 1.4407

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001756{col 26}{space 2} .0282437{col 37}{space 1}   35.47{col 46}{space 3}0.000{col 54}{space 4} .9462078{col 67}{space 3} 1.057304
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.218137{col 26}{space 2} .6852442{col 37}{space 1}   -6.16{col 46}{space 3}0.000{col 54}{space 4}-5.565838{col 67}{space 3}-2.870436
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       352
{txt}{hline 13}{c +}{hline 34}   F(1, 350)       = {res}  1249.51
{txt}       Model {c |} {res} 2600.33607         1  2600.33607   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 728.380876       350  2.08108822   {txt}R-squared       ={res}    0.7812
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7806
{txt}       Total {c |} {res} 3328.71695       351  9.48352406   {txt}Root MSE        =   {res} 1.4426

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.001254{col 26}{space 2} .0283253{col 37}{space 1}   35.35{col 46}{space 3}0.000{col 54}{space 4} .9455449{col 67}{space 3} 1.056963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.207326{col 26}{space 2} .6869937{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4}-5.558481{col 67}{space 3}-2.856171
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       351
{txt}{hline 13}{c +}{hline 34}   F(1, 349)       = {res}  1240.64
{txt}       Model {c |} {res} 2588.68068         1  2588.68068   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 728.211016       349  2.08656451   {txt}R-squared       ={res}    0.7805
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7798
{txt}       Total {c |} {res}  3316.8917       350  9.47683342   {txt}Root MSE        =   {res} 1.4445

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.000773{col 26}{space 2} .0284127{col 37}{space 1}   35.22{col 46}{space 3}0.000{col 54}{space 4} .9448913{col 67}{space 3} 1.056655
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.196901{col 26}{space 2} .6888666{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-5.551753{col 67}{space 3}-2.842049
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       350
{txt}{hline 13}{c +}{hline 34}   F(1, 348)       = {res}  1231.06
{txt}       Model {c |} {res} 2575.07841         1  2575.07841   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 727.933625       348  2.09176329   {txt}R-squared       ={res}    0.7796
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7790
{txt}       Total {c |} {res} 3303.01203       349  9.46421786   {txt}Root MSE        =   {res} 1.4463

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  1.00012{col 26}{space 2} .0285045{col 37}{space 1}   35.09{col 46}{space 3}0.000{col 54}{space 4} .9440573{col 67}{space 3} 1.056183
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.182678{col 26}{space 2} .6908292{col 37}{space 1}   -6.05{col 46}{space 3}0.000{col 54}{space 4}-5.541404{col 67}{space 3}-2.823952
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       349
{txt}{hline 13}{c +}{hline 34}   F(1, 347)       = {res}  1220.97
{txt}       Model {c |} {res} 2558.11218         1  2558.11218   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  727.01783       347  2.09515225   {txt}R-squared       ={res}    0.7787
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7781
{txt}       Total {c |} {res} 3285.13001       348  9.44002878   {txt}Root MSE        =   {res} 1.4475

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9989008{col 26}{space 2} .0285871{col 37}{space 1}   34.94{col 46}{space 3}0.000{col 54}{space 4}  .942675{col 67}{space 3} 1.055127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.156057{col 26}{space 2} .6925601{col 37}{space 1}   -6.00{col 46}{space 3}0.000{col 54}{space 4}-5.518201{col 67}{space 3}-2.793913
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       348
{txt}{hline 13}{c +}{hline 34}   F(1, 346)       = {res}  1210.88
{txt}       Model {c |} {res} 2542.48873         1  2542.48873   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 726.499525       346  2.09970961   {txt}R-squared       ={res}    0.7778
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7771
{txt}       Total {c |} {res} 3268.98825       347  9.42071543   {txt}Root MSE        =   {res}  1.449

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9979713{col 26}{space 2} .0286793{col 37}{space 1}   34.80{col 46}{space 3}0.000{col 54}{space 4} .9415637{col 67}{space 3} 1.054379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.135751{col 26}{space 2} .6945166{col 37}{space 1}   -5.95{col 46}{space 3}0.000{col 54}{space 4}-5.501756{col 67}{space 3}-2.769745
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       347
{txt}{hline 13}{c +}{hline 34}   F(1, 345)       = {res}  1201.23
{txt}       Model {c |} {res}  2528.6707         1   2528.6707   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 726.246002       345  2.10506087   {txt}R-squared       ={res}    0.7769
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7762
{txt}       Total {c |} {res}  3254.9167       346   9.4072737   {txt}Root MSE        =   {res} 1.4509

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9973279{col 26}{space 2} .0287756{col 37}{space 1}   34.66{col 46}{space 3}0.000{col 54}{space 4} .9407302{col 67}{space 3} 1.053926
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.121719{col 26}{space 2} .6965755{col 37}{space 1}   -5.92{col 46}{space 3}0.000{col 54}{space 4}-5.491788{col 67}{space 3} -2.75165
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       346
{txt}{hline 13}{c +}{hline 34}   F(1, 344)       = {res}  1191.08
{txt}       Model {c |} {res} 2512.62671         1  2512.62671   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 725.682044       344  2.10954083   {txt}R-squared       ={res}    0.7759
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7753
{txt}       Total {c |} {res} 3238.30876       345  9.38640219   {txt}Root MSE        =   {res} 1.4524

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9963406{col 26}{space 2} .0288694{col 37}{space 1}   34.51{col 46}{space 3}0.000{col 54}{space 4} .9395579{col 67}{space 3} 1.053123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.100142{col 26}{space 2} .6985639{col 37}{space 1}   -5.87{col 46}{space 3}0.000{col 54}{space 4}-5.474136{col 67}{space 3}-2.726148
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       345
{txt}{hline 13}{c +}{hline 34}   F(1, 343)       = {res}  1180.54
{txt}       Model {c |} {res}  2496.0357         1   2496.0357   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 725.212639       343  2.11432256   {txt}R-squared       ={res}    0.7749
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7742
{txt}       Total {c |} {res} 3221.24834       344    9.364094   {txt}Root MSE        =   {res} 1.4541

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .995402{col 26}{space 2} .0289707{col 37}{space 1}   34.36{col 46}{space 3}0.000{col 54}{space 4} .9384194{col 67}{space 3} 1.052385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.079559{col 26}{space 2} .7007182{col 37}{space 1}   -5.82{col 46}{space 3}0.000{col 54}{space 4}-5.457804{col 67}{space 3}-2.701313
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       344
{txt}{hline 13}{c +}{hline 34}   F(1, 342)       = {res}  1170.13
{txt}       Model {c |} {res} 2480.81234         1  2480.81234   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 725.082972       342  2.12012565   {txt}R-squared       ={res}    0.7738
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7732
{txt}       Total {c |} {res} 3205.89531       343  9.34663356   {txt}Root MSE        =   {res} 1.4561

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9948896{col 26}{space 2} .0290843{col 37}{space 1}   34.21{col 46}{space 3}0.000{col 54}{space 4} .9376829{col 67}{space 3} 1.052096
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.068291{col 26}{space 2} .7031569{col 37}{space 1}   -5.79{col 46}{space 3}0.000{col 54}{space 4}-5.451347{col 67}{space 3}-2.685234
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       343
{txt}{hline 13}{c +}{hline 34}   F(1, 341)       = {res}  1158.79
{txt}       Model {c |} {res} 2462.06827         1  2462.06827   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 724.516291       341  2.12468121   {txt}R-squared       ={res}    0.7726
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7720
{txt}       Total {c |} {res} 3186.58456       342  9.31749871   {txt}Root MSE        =   {res} 1.4576

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9937866{col 26}{space 2} .0291938{col 37}{space 1}   34.04{col 46}{space 3}0.000{col 54}{space 4} .9363641{col 67}{space 3} 1.051209
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.04399{col 26}{space 2} .7054829{col 37}{space 1}   -5.73{col 46}{space 3}0.000{col 54}{space 4}-5.431636{col 67}{space 3}-2.656344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       342
{txt}{hline 13}{c +}{hline 34}   F(1, 340)       = {res}  1147.34
{txt}       Model {c |} {res} 2443.32408         1  2443.32408   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 724.051525       340  2.12956331   {txt}R-squared       ={res}    0.7714
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7707
{txt}       Total {c |} {res} 3167.37561       341  9.28849152   {txt}Root MSE        =   {res} 1.4593

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9927648{col 26}{space 2}  .029309{col 37}{space 1}   33.87{col 46}{space 3}0.000{col 54}{space 4}  .935115{col 67}{space 3} 1.050415
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.021447{col 26}{space 2} .7079394{col 37}{space 1}   -5.68{col 46}{space 3}0.000{col 54}{space 4} -5.41394{col 67}{space 3}-2.628955
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       341
{txt}{hline 13}{c +}{hline 34}   F(1, 339)       = {res}  1137.22
{txt}       Model {c |} {res} 2428.46365         1  2428.46365   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 723.912957       339  2.13543645   {txt}R-squared       ={res}    0.7704
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7697
{txt}       Total {c |} {res} 3152.37661       340   9.2716959   {txt}Root MSE        =   {res} 1.4613

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9922339{col 26}{space 2} .0294233{col 37}{space 1}   33.72{col 46}{space 3}0.000{col 54}{space 4} .9343586{col 67}{space 3} 1.050109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.009795{col 26}{space 2} .7103891{col 37}{space 1}   -5.64{col 46}{space 3}0.000{col 54}{space 4}-5.407121{col 67}{space 3} -2.61247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       340
{txt}{hline 13}{c +}{hline 34}   F(1, 338)       = {res}  1126.70
{txt}       Model {c |} {res} 2412.81542         1  2412.81542   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 723.824547       338  2.14149274   {txt}R-squared       ={res}    0.7692
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7686
{txt}       Total {c |} {res} 3136.63996       339  9.25262526   {txt}Root MSE        =   {res} 1.4634

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9917867{col 26}{space 2} .0295471{col 37}{space 1}   33.57{col 46}{space 3}0.000{col 54}{space 4} .9336674{col 67}{space 3} 1.049906
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.999942{col 26}{space 2} .7130467{col 37}{space 1}   -5.61{col 46}{space 3}0.000{col 54}{space 4} -5.40251{col 67}{space 3}-2.597374
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       339
{txt}{hline 13}{c +}{hline 34}   F(1, 337)       = {res}  1115.61
{txt}       Model {c |} {res} 2395.72105         1  2395.72105   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 723.692828       337  2.14745646   {txt}R-squared       ={res}    0.7680
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7673
{txt}       Total {c |} {res} 3119.41388       338  9.22903514   {txt}Root MSE        =   {res} 1.4654

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9912198{col 26}{space 2} .0296766{col 37}{space 1}   33.40{col 46}{space 3}0.000{col 54}{space 4} .9328451{col 67}{space 3} 1.049595
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.987419{col 26}{space 2}  .715827{col 37}{space 1}   -5.57{col 46}{space 3}0.000{col 54}{space 4}-5.395471{col 67}{space 3}-2.579367
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       338
{txt}{hline 13}{c +}{hline 34}   F(1, 336)       = {res}  1105.52
{txt}       Model {c |} {res} 2381.12403         1  2381.12403   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 723.692793       336   2.1538476   {txt}R-squared       ={res}    0.7669
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7662
{txt}       Total {c |} {res} 3104.81682       337   9.2131063   {txt}Root MSE        =   {res} 1.4676

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9912106{col 26}{space 2} .0298114{col 37}{space 1}   33.25{col 46}{space 3}0.000{col 54}{space 4} .9325701{col 67}{space 3} 1.049851
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.987214{col 26}{space 2} .7187279{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-5.400988{col 67}{space 3}-2.573441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       337
{txt}{hline 13}{c +}{hline 34}   F(1, 335)       = {res}  1093.21
{txt}       Model {c |} {res} 2358.77032         1  2358.77032   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  722.81246       335  2.15764913   {txt}R-squared       ={res}    0.7654
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7647
{txt}       Total {c |} {res} 3081.58278       336  9.17137732   {txt}Root MSE        =   {res} 1.4689

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9896884{col 26}{space 2} .0299327{col 37}{space 1}   33.06{col 46}{space 3}0.000{col 54}{space 4} .9308086{col 67}{space 3} 1.048568
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.953532{col 26}{space 2}  .721292{col 37}{space 1}   -5.48{col 46}{space 3}0.000{col 54}{space 4}-5.372364{col 67}{space 3}-2.534699
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       336
{txt}{hline 13}{c +}{hline 34}   F(1, 334)       = {res}  1081.52
{txt}       Model {c |} {res} 2339.86988         1  2339.86988   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 722.608962       334  2.16349989   {txt}R-squared       ={res}    0.7640
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7633
{txt}       Total {c |} {res} 3062.47884       335  9.14172788   {txt}Root MSE        =   {res} 1.4709

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9889438{col 26}{space 2} .0300714{col 37}{space 1}   32.89{col 46}{space 3}0.000{col 54}{space 4} .9297905{col 67}{space 3} 1.048097
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.937044{col 26}{space 2} .7242671{col 37}{space 1}   -5.44{col 46}{space 3}0.000{col 54}{space 4}-5.361745{col 67}{space 3}-2.512344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       335
{txt}{hline 13}{c +}{hline 34}   F(1, 333)       = {res}  1069.77
{txt}       Model {c |} {res} 2319.54868         1  2319.54868   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  722.03338       333  2.16826841   {txt}R-squared       ={res}    0.7626
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7619
{txt}       Total {c |} {res} 3041.58206       334  9.10653312   {txt}Root MSE        =   {res} 1.4725

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9877167{col 26}{space 2} .0301986{col 37}{space 1}   32.71{col 46}{space 3}0.000{col 54}{space 4} .9283125{col 67}{space 3} 1.047121
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.90994{col 26}{space 2} .7269708{col 37}{space 1}   -5.38{col 46}{space 3}0.000{col 54}{space 4}-5.339974{col 67}{space 3}-2.479906
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       334
{txt}{hline 13}{c +}{hline 34}   F(1, 332)       = {res}  1058.21
{txt}       Model {c |} {res} 2298.63368         1  2298.63368   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 721.169341       332  2.17219681   {txt}R-squared       ={res}    0.7612
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7605
{txt}       Total {c |} {res} 3019.80302       333  9.06847753   {txt}Root MSE        =   {res} 1.4738

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9862318{col 26}{space 2} .0303175{col 37}{space 1}   32.53{col 46}{space 3}0.000{col 54}{space 4} .9265931{col 67}{space 3}  1.04587
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.877202{col 26}{space 2} .7294783{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-5.312184{col 67}{space 3}-2.442219
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       333
{txt}{hline 13}{c +}{hline 34}   F(1, 331)       = {res}  1046.59
{txt}       Model {c |} {res} 2278.70083         1  2278.70083   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.670701       331  2.17725287   {txt}R-squared       ={res}    0.7597
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7590
{txt}       Total {c |} {res} 2999.37153       332  9.03425159   {txt}Root MSE        =   {res} 1.4756

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9850719{col 26}{space 2} .0304494{col 37}{space 1}   32.35{col 46}{space 3}0.000{col 54}{space 4} .9251732{col 67}{space 3} 1.044971
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.851589{col 26}{space 2} .7322852{col 37}{space 1}   -5.26{col 46}{space 3}0.000{col 54}{space 4}-5.292108{col 67}{space 3}-2.411069
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. * In this loop, I am running 58 regressions corresponding to each year, to see whether the coefficent of effect has changed at all during the years. I only did it for these specific years, because Stata and my computer would not be able to load that many regressions all at once, and I really only need to prove that the effect changes throughout the years by using one country with 1960-2018 observations. Here, I chose the time statement for the country of Mexico for these 58 years. 

. coefplot reg_*, drop(_cons) nokey 
{res}
{com}. * Here we are determining whether the relationship of lnGDP on lnFDI has changed in way where there might be some unobserved heterogeneity as with unobserved variables becoming correlated with the error terms of our regression variables. We can see, in part, this is true as there is some sort of shift between the effect of lnGDP on lnFDI throughout the years. The fixed effect models attempts to control for this along with lagged effects. 

. 
. foreach i of num 1181/1239{c -(}
{txt}  2{com}. reg lnFDI lnGDP if t>`i' & t<`i' + 1239
{txt}  3{com}. est store regex_`i'
{txt}  4{com}.  {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       332
{txt}{hline 13}{c +}{hline 34}   F(1, 330)       = {res}  1034.65
{txt}       Model {c |} {res} 2257.56098         1  2257.56098   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 720.042096       330  2.18194574   {txt}R-squared       ={res}    0.7582
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7574
{txt}       Total {c |} {res} 2977.60308       331   8.9957797   {txt}Root MSE        =   {res} 1.4771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9837392{col 26}{space 2} .0305831{col 37}{space 1}   32.17{col 46}{space 3}0.000{col 54}{space 4} .9235767{col 67}{space 3} 1.043902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.822127{col 26}{space 2} .7351261{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-5.268251{col 67}{space 3}-2.376003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       331
{txt}{hline 13}{c +}{hline 34}   F(1, 329)       = {res}  1027.04
{txt}       Model {c |} {res} 2247.61301         1  2247.61301   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 719.998424       329  2.18844506   {txt}R-squared       ={res}    0.7574
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7566
{txt}       Total {c |} {res} 2967.61144       330  8.99276193   {txt}Root MSE        =   {res} 1.4793

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9840468{col 26}{space 2}  .030706{col 37}{space 1}   32.05{col 46}{space 3}0.000{col 54}{space 4}  .923642{col 67}{space 3} 1.044452
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.830108{col 26}{space 2} .7383846{col 37}{space 1}   -5.19{col 46}{space 3}0.000{col 54}{space 4}-5.282658{col 67}{space 3}-2.377557
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       330
{txt}{hline 13}{c +}{hline 34}   F(1, 328)       = {res}  1018.98
{txt}       Model {c |} {res}  2236.7832         1   2236.7832   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 719.997626       328  2.19511471   {txt}R-squared       ={res}    0.7565
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7558
{txt}       Total {c |} {res} 2956.78083       329  8.98717576   {txt}Root MSE        =   {res} 1.4816

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .984088{col 26}{space 2} .0308284{col 37}{space 1}   31.92{col 46}{space 3}0.000{col 54}{space 4} .9234417{col 67}{space 3} 1.044734
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.831177{col 26}{space 2} .7416322{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-5.290133{col 67}{space 3}-2.372221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       329
{txt}{hline 13}{c +}{hline 34}   F(1, 327)       = {res}  1010.22
{txt}       Model {c |} {res} 2224.02239         1  2224.02239   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 719.894817       327   2.2015132   {txt}R-squared       ={res}    0.7555
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7547
{txt}       Total {c |} {res}  2943.9172       328  8.97535732   {txt}Root MSE        =   {res} 1.4837

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9836261{col 26}{space 2} .0309472{col 37}{space 1}   31.78{col 46}{space 3}0.000{col 54}{space 4} .9227454{col 67}{space 3} 1.044507
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.819157{col 26}{space 2} .7447924{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-5.284346{col 67}{space 3}-2.353968
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       328
{txt}{hline 13}{c +}{hline 34}   F(1, 326)       = {res}  1002.27
{txt}       Model {c |} {res} 2213.07017         1  2213.07017   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 719.828263       326  2.20806216   {txt}R-squared       ={res}    0.7546
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7538
{txt}       Total {c |} {res} 2932.89844       327  8.96910837   {txt}Root MSE        =   {res}  1.486

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9832759{col 26}{space 2} .0310587{col 37}{space 1}   31.66{col 46}{space 3}0.000{col 54}{space 4} .9221751{col 67}{space 3} 1.044377
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.809995{col 26}{space 2} .7477638{col 37}{space 1}   -5.10{col 46}{space 3}0.000{col 54}{space 4}-5.281046{col 67}{space 3}-2.338943
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       327
{txt}{hline 13}{c +}{hline 34}   F(1, 325)       = {res}   994.86
{txt}       Model {c |} {res} 2202.57069         1  2202.57069   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 719.536069       325  2.21395714   {txt}R-squared       ={res}    0.7538
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7530
{txt}       Total {c |} {res} 2922.10676       326  8.96351768   {txt}Root MSE        =   {res} 1.4879

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9826155{col 26}{space 2} .0311532{col 37}{space 1}   31.54{col 46}{space 3}0.000{col 54}{space 4}  .921328{col 67}{space 3} 1.043903
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.792536{col 26}{space 2} .7503021{col 37}{space 1}   -5.05{col 46}{space 3}0.000{col 54}{space 4}-5.268597{col 67}{space 3}-2.316474
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       326
{txt}{hline 13}{c +}{hline 34}   F(1, 324)       = {res}   987.42
{txt}       Model {c |} {res} 2190.78016         1  2190.78016   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 718.855835       324  2.21869085   {txt}R-squared       ={res}    0.7529
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7522
{txt}       Total {c |} {res} 2909.63599       325  8.95272614   {txt}Root MSE        =   {res} 1.4895

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9816174{col 26}{space 2} .0312386{col 37}{space 1}   31.42{col 46}{space 3}0.000{col 54}{space 4} .9201613{col 67}{space 3} 1.043073
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.766113{col 26}{space 2} .7526181{col 37}{space 1}   -5.00{col 46}{space 3}0.000{col 54}{space 4}-5.246748{col 67}{space 3}-2.285477
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       325
{txt}{hline 13}{c +}{hline 34}   F(1, 323)       = {res}   980.44
{txt}       Model {c |} {res} 2180.05345         1  2180.05345   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 718.201889       323  2.22353526   {txt}R-squared       ={res}    0.7522
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7514
{txt}       Total {c |} {res} 2898.25534       324  8.94523252   {txt}Root MSE        =   {res} 1.4912

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9806862{col 26}{space 2} .0313198{col 37}{space 1}   31.31{col 46}{space 3}0.000{col 54}{space 4} .9190697{col 67}{space 3} 1.042303
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.741325{col 26}{space 2} .7548245{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4}-5.226318{col 67}{space 3}-2.256332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       324
{txt}{hline 13}{c +}{hline 34}   F(1, 322)       = {res}   974.33
{txt}       Model {c |} {res} 2168.39405         1  2168.39405   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 716.619296       322  2.22552576   {txt}R-squared       ={res}    0.7516
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7508
{txt}       Total {c |} {res} 2885.01335       323  8.93192987   {txt}Root MSE        =   {res} 1.4918

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9793361{col 26}{space 2} .0313747{col 37}{space 1}   31.21{col 46}{space 3}0.000{col 54}{space 4} .9176109{col 67}{space 3} 1.041061
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.705101{col 26}{space 2}  .756383{col 37}{space 1}   -4.90{col 46}{space 3}0.000{col 54}{space 4}-5.193178{col 67}{space 3}-2.217025
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       323
{txt}{hline 13}{c +}{hline 34}   F(1, 321)       = {res}   968.60
{txt}       Model {c |} {res} 2154.82832         1  2154.82832   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 714.125527       321  2.22469012   {txt}R-squared       ={res}    0.7511
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7503
{txt}       Total {c |} {res} 2868.95385       322  8.90979457   {txt}Root MSE        =   {res} 1.4915

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9776003{col 26}{space 2} .0314116{col 37}{space 1}   31.12{col 46}{space 3}0.000{col 54}{space 4} .9158018{col 67}{space 3} 1.039399
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.658619{col 26}{space 2} .7575143{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-5.148939{col 67}{space 3}-2.168299
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       322
{txt}{hline 13}{c +}{hline 34}   F(1, 320)       = {res}   963.17
{txt}       Model {c |} {res} 2135.18774         1  2135.18774   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 709.386537       320  2.21683293   {txt}R-squared       ={res}    0.7506
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7498
{txt}       Total {c |} {res} 2844.57427       321   8.8616021   {txt}Root MSE        =   {res} 1.4889

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9748652{col 26}{space 2} .0314118{col 37}{space 1}   31.03{col 46}{space 3}0.000{col 54}{space 4} .9130654{col 67}{space 3} 1.036665
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.586293{col 26}{space 2} .7577917{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-5.077177{col 67}{space 3} -2.09541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       321
{txt}{hline 13}{c +}{hline 34}   F(1, 319)       = {res}   956.74
{txt}       Model {c |} {res} 2124.35247         1  2124.35247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 708.306736       319  2.22039729   {txt}R-squared       ={res}    0.7499
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7492
{txt}       Total {c |} {res} 2832.65921       320  8.85206002   {txt}Root MSE        =   {res} 1.4901

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9737183{col 26}{space 2}   .03148{col 37}{space 1}   30.93{col 46}{space 3}0.000{col 54}{space 4} .9117835{col 67}{space 3} 1.035653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.555555{col 26}{space 2} .7596805{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-5.050172{col 67}{space 3}-2.060938
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       321
{txt}{hline 13}{c +}{hline 34}   F(1, 319)       = {res}   956.74
{txt}       Model {c |} {res} 2124.35247         1  2124.35247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 708.306736       319  2.22039729   {txt}R-squared       ={res}    0.7499
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7492
{txt}       Total {c |} {res} 2832.65921       320  8.85206002   {txt}Root MSE        =   {res} 1.4901

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9737183{col 26}{space 2}   .03148{col 37}{space 1}   30.93{col 46}{space 3}0.000{col 54}{space 4} .9117835{col 67}{space 3} 1.035653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.555555{col 26}{space 2} .7596805{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-5.050172{col 67}{space 3}-2.060938
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       320
{txt}{hline 13}{c +}{hline 34}   F(1, 318)       = {res}   951.09
{txt}       Model {c |} {res} 2112.65513         1  2112.65513   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 706.372525       318  2.22129725   {txt}R-squared       ={res}    0.7494
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7486
{txt}       Total {c |} {res} 2819.02765       319  8.83707728   {txt}Root MSE        =   {res} 1.4904

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9722483{col 26}{space 2} .0315258{col 37}{space 1}   30.84{col 46}{space 3}0.000{col 54}{space 4} .9102228{col 67}{space 3} 1.034274
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.51595{col 26}{space 2} .7610189{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-5.013218{col 67}{space 3}-2.018681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       319
{txt}{hline 13}{c +}{hline 34}   F(1, 317)       = {res}   986.12
{txt}       Model {c |} {res} 2080.97248         1  2080.97248   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 668.954365       317  2.11026614   {txt}R-squared       ={res}    0.7567
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7560
{txt}       Total {c |} {res} 2749.92685       318  8.64756871   {txt}Root MSE        =   {res} 1.4527

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9660405{col 26}{space 2} .0307631{col 37}{space 1}   31.40{col 46}{space 3}0.000{col 54}{space 4} .9055147{col 67}{space 3} 1.026566
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.347828{col 26}{space 2} .7428292{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-4.809326{col 67}{space 3} -1.88633
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       318
{txt}{hline 13}{c +}{hline 34}   F(1, 316)       = {res}   982.74
{txt}       Model {c |} {res} 2068.59285         1  2068.59285   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 665.157812       316  2.10492978   {txt}R-squared       ={res}    0.7567
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7559
{txt}       Total {c |} {res} 2733.75066       317  8.62381911   {txt}Root MSE        =   {res} 1.4508

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9641612{col 26}{space 2} .0307561{col 37}{space 1}   31.35{col 46}{space 3}0.000{col 54}{space 4} .9036486{col 67}{space 3} 1.024674
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.296598{col 26}{space 2} .7428694{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-4.758193{col 67}{space 3}-1.835003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       318
{txt}{hline 13}{c +}{hline 34}   F(1, 316)       = {res}   982.74
{txt}       Model {c |} {res} 2068.59285         1  2068.59285   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 665.157812       316  2.10492978   {txt}R-squared       ={res}    0.7567
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7559
{txt}       Total {c |} {res} 2733.75066       317  8.62381911   {txt}Root MSE        =   {res} 1.4508

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9641612{col 26}{space 2} .0307561{col 37}{space 1}   31.35{col 46}{space 3}0.000{col 54}{space 4} .9036486{col 67}{space 3} 1.024674
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.296598{col 26}{space 2} .7428694{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-4.758193{col 67}{space 3}-1.835003
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       317
{txt}{hline 13}{c +}{hline 34}   F(1, 315)       = {res}  1034.06
{txt}       Model {c |} {res} 2035.21985         1  2035.21985   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 619.976124       315  1.96817817   {txt}R-squared       ={res}    0.7665
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7658
{txt}       Total {c |} {res} 2655.19598       316  8.40251891   {txt}Root MSE        =   {res} 1.4029

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9574213{col 26}{space 2} .0297735{col 37}{space 1}   32.16{col 46}{space 3}0.000{col 54}{space 4} .8988412{col 67}{space 3} 1.016001
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.11359{col 26}{space 2} .7193479{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-4.528924{col 67}{space 3}-1.698256
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       316
{txt}{hline 13}{c +}{hline 34}   F(1, 314)       = {res}  1041.39
{txt}       Model {c |} {res} 2019.35771         1  2019.35771   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 608.878954       314  1.93910495   {txt}R-squared       ={res}    0.7683
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7676
{txt}       Total {c |} {res} 2628.23666       315  8.34360846   {txt}Root MSE        =   {res} 1.3925

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9544979{col 26}{space 2}  .029578{col 37}{space 1}   32.27{col 46}{space 3}0.000{col 54}{space 4} .8963018{col 67}{space 3} 1.012694
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.032851{col 26}{space 2} .7148124{col 37}{space 1}   -4.24{col 46}{space 3}0.000{col 54}{space 4}-4.439278{col 67}{space 3}-1.626424
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       316
{txt}{hline 13}{c +}{hline 34}   F(1, 314)       = {res}  1041.39
{txt}       Model {c |} {res} 2019.35771         1  2019.35771   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 608.878954       314  1.93910495   {txt}R-squared       ={res}    0.7683
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7676
{txt}       Total {c |} {res} 2628.23666       315  8.34360846   {txt}Root MSE        =   {res} 1.3925

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9544979{col 26}{space 2}  .029578{col 37}{space 1}   32.27{col 46}{space 3}0.000{col 54}{space 4} .8963018{col 67}{space 3} 1.012694
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.032851{col 26}{space 2} .7148124{col 37}{space 1}   -4.24{col 46}{space 3}0.000{col 54}{space 4}-4.439278{col 67}{space 3}-1.626424
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       315
{txt}{hline 13}{c +}{hline 34}   F(1, 313)       = {res}  1033.09
{txt}       Model {c |} {res} 1997.46596         1  1997.46596   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 605.182663       313  1.93349094   {txt}R-squared       ={res}    0.7675
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7667
{txt}       Total {c |} {res} 2602.64862       314  8.28868989   {txt}Root MSE        =   {res} 1.3905

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9516369{col 26}{space 2} .0296076{col 37}{space 1}   32.14{col 46}{space 3}0.000{col 54}{space 4} .8933819{col 67}{space 3} 1.009892
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.958017{col 26}{space 2} .7158259{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-4.366456{col 67}{space 3}-1.549578
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       314
{txt}{hline 13}{c +}{hline 34}   F(1, 312)       = {res}  1033.21
{txt}       Model {c |} {res}  1966.4871         1   1966.4871   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 593.821541       312  1.90327417   {txt}R-squared       ={res}    0.7681
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7673
{txt}       Total {c |} {res} 2560.30864       313   8.1798998   {txt}Root MSE        =   {res} 1.3796

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9465746{col 26}{space 2} .0294483{col 37}{space 1}   32.14{col 46}{space 3}0.000{col 54}{space 4} .8886322{col 67}{space 3} 1.004517
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.825615{col 26}{space 2}  .712275{col 37}{space 1}   -3.97{col 46}{space 3}0.000{col 54}{space 4}-4.227085{col 67}{space 3}-1.424145
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       313
{txt}{hline 13}{c +}{hline 34}   F(1, 311)       = {res}  1027.27
{txt}       Model {c |} {res} 1960.95881         1  1960.95881   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 593.671509       311   1.9089116   {txt}R-squared       ={res}    0.7676
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7669
{txt}       Total {c |} {res} 2554.63032       312   8.1879177   {txt}Root MSE        =   {res} 1.3816

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .947092{col 26}{space 2} .0295495{col 37}{space 1}   32.05{col 46}{space 3}0.000{col 54}{space 4} .8889496{col 67}{space 3} 1.005234
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.839292{col 26}{space 2} .7149953{col 37}{space 1}   -3.97{col 46}{space 3}0.000{col 54}{space 4}-4.246132{col 67}{space 3}-1.432452
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       312
{txt}{hline 13}{c +}{hline 34}   F(1, 310)       = {res}  1019.35
{txt}       Model {c |} {res} 1949.92175         1  1949.92175   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 592.999759       310  1.91290245   {txt}R-squared       ={res}    0.7668
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7661
{txt}       Total {c |} {res} 2542.92151       311  8.17659649   {txt}Root MSE        =   {res} 1.3831

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9460595{col 26}{space 2} .0296317{col 37}{space 1}   31.93{col 46}{space 3}0.000{col 54}{space 4} .8877549{col 67}{space 3} 1.004364
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.811833{col 26}{space 2} .7172407{col 37}{space 1}   -3.92{col 46}{space 3}0.000{col 54}{space 4}-4.223109{col 67}{space 3}-1.400557
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(1, 309)       = {res}  1012.91
{txt}       Model {c |} {res} 1943.78874         1  1943.78874   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 592.977883       309  1.91902227   {txt}R-squared       ={res}    0.7662
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7655
{txt}       Total {c |} {res} 2536.76662       310  8.18311813   {txt}Root MSE        =   {res} 1.3853

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9462485{col 26}{space 2} .0297318{col 37}{space 1}   31.83{col 46}{space 3}0.000{col 54}{space 4} .8877462{col 67}{space 3} 1.004751
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.816855{col 26}{space 2} .7199254{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-4.233431{col 67}{space 3}-1.400279
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       310
{txt}{hline 13}{c +}{hline 34}   F(1, 308)       = {res}  1007.25
{txt}       Model {c |} {res} 1938.65436         1  1938.65436   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 592.807197       308  1.92469869   {txt}R-squared       ={res}    0.7658
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7651
{txt}       Total {c |} {res} 2531.46156       309  8.19243223   {txt}Root MSE        =   {res} 1.3873

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9458679{col 26}{space 2} .0298031{col 37}{space 1}   31.74{col 46}{space 3}0.000{col 54}{space 4} .8872244{col 67}{space 3} 1.004511
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.806363{col 26}{space 2} .7218497{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-4.226744{col 67}{space 3}-1.385983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       309
{txt}{hline 13}{c +}{hline 34}   F(1, 307)       = {res}  1002.60
{txt}       Model {c |} {res} 1935.90616         1  1935.90616   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 592.780162       307  1.93088001   {txt}R-squared       ={res}    0.7656
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7648
{txt}       Total {c |} {res} 2528.68632       308  8.21002052   {txt}Root MSE        =   {res} 1.3896

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9460149{col 26}{space 2} .0298768{col 37}{space 1}   31.66{col 46}{space 3}0.000{col 54}{space 4} .8872257{col 67}{space 3} 1.004804
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.810433{col 26}{space 2} .7238254{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 54}{space 4} -4.23472{col 67}{space 3}-1.386146
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       308
{txt}{hline 13}{c +}{hline 34}   F(1, 306)       = {res}   998.77
{txt}       Model {c |} {res} 1934.21037         1  1934.21037   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 592.596753       306   1.9365907   {txt}R-squared       ={res}    0.7655
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7647
{txt}       Total {c |} {res} 2526.80712       307   8.2306421   {txt}Root MSE        =   {res} 1.3916

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9463916{col 26}{space 2} .0299459{col 37}{space 1}   31.60{col 46}{space 3}0.000{col 54}{space 4} .8874656{col 67}{space 3} 1.005318
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.820895{col 26}{space 2} .7256918{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-4.248873{col 67}{space 3}-1.392918
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(1, 305)       = {res}   997.09
{txt}       Model {c |} {res} 1934.37989         1  1934.37989   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 591.710246       305  1.94003359   {txt}R-squared       ={res}    0.7658
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7650
{txt}       Total {c |} {res} 2526.09013       306  8.25519651   {txt}Root MSE        =   {res} 1.3929

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9472158{col 26}{space 2} .0299973{col 37}{space 1}   31.58{col 46}{space 3}0.000{col 54}{space 4} .8881879{col 67}{space 3} 1.006244
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.843813{col 26}{space 2} .7271273{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-4.274634{col 67}{space 3}-1.412992
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       306
{txt}{hline 13}{c +}{hline 34}   F(1, 304)       = {res}   995.55
{txt}       Model {c |} {res} 1934.70386         1  1934.70386   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 590.779175       304  1.94335255   {txt}R-squared       ={res}    0.7661
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7653
{txt}       Total {c |} {res} 2525.48303       305  8.28027224   {txt}Root MSE        =   {res}  1.394

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9480402{col 26}{space 2} .0300466{col 37}{space 1}   31.55{col 46}{space 3}0.000{col 54}{space 4} .8889145{col 67}{space 3} 1.007166
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.866826{col 26}{space 2} .7285081{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-4.300383{col 67}{space 3}-1.433269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       305
{txt}{hline 13}{c +}{hline 34}   F(1, 303)       = {res}   996.29
{txt}       Model {c |} {res} 1936.43963         1  1936.43963   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 588.924075       303  1.94364381   {txt}R-squared       ={res}    0.7668
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7660
{txt}       Total {c |} {res}  2525.3637       304  8.30711744   {txt}Root MSE        =   {res} 1.3941

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9491799{col 26}{space 2} .0300715{col 37}{space 1}   31.56{col 46}{space 3}0.000{col 54}{space 4} .8900045{col 67}{space 3} 1.008355
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.898756{col 26}{space 2} .7292954{col 37}{space 1}   -3.97{col 46}{space 3}0.000{col 54}{space 4}-4.333881{col 67}{space 3}-1.463631
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       304
{txt}{hline 13}{c +}{hline 34}   F(1, 302)       = {res}   995.42
{txt}       Model {c |} {res} 1937.27592         1  1937.27592   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 587.748407       302  1.94618678   {txt}R-squared       ={res}    0.7672
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7665
{txt}       Total {c |} {res} 2525.02432       303  8.33341361   {txt}Root MSE        =   {res} 1.3951

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .950066{col 26}{space 2} .0301127{col 37}{space 1}   31.55{col 46}{space 3}0.000{col 54}{space 4} .8908087{col 67}{space 3} 1.009323
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.923681{col 26}{space 2} .7304766{col 37}{space 1}   -4.00{col 46}{space 3}0.000{col 54}{space 4}-4.361149{col 67}{space 3}-1.486212
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       303
{txt}{hline 13}{c +}{hline 34}   F(1, 301)       = {res}   991.93
{txt}       Model {c |} {res} 1936.15886         1  1936.15886   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 587.522567       301  1.95190222   {txt}R-squared       ={res}    0.7672
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7664
{txt}       Total {c |} {res} 2523.68143       302  8.35656103   {txt}Root MSE        =   {res} 1.3971

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .950447{col 26}{space 2} .0301777{col 37}{space 1}   31.49{col 46}{space 3}0.000{col 54}{space 4}  .891061{col 67}{space 3} 1.009833
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.934435{col 26}{space 2} .7322313{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-4.375375{col 67}{space 3}-1.493494
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       302
{txt}{hline 13}{c +}{hline 34}   F(1, 300)       = {res}   989.68
{txt}       Model {c |} {res} 1936.06804         1  1936.06804   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 586.879808       300  1.95626603   {txt}R-squared       ={res}    0.7674
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7666
{txt}       Total {c |} {res} 2522.94785       301  8.38188653   {txt}Root MSE        =   {res} 1.3987

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9510999{col 26}{space 2} .0302329{col 37}{space 1}   31.46{col 46}{space 3}0.000{col 54}{space 4} .8916045{col 67}{space 3} 1.010595
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.952832{col 26}{space 2} .7337516{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4}-4.396784{col 67}{space 3} -1.50888
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       301
{txt}{hline 13}{c +}{hline 34}   F(1, 299)       = {res}   987.30
{txt}       Model {c |} {res} 1935.90777         1  1935.90777   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 586.279352       299  1.96080051   {txt}R-squared       ={res}    0.7676
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7668
{txt}       Total {c |} {res} 2522.18713       300  8.40729042   {txt}Root MSE        =   {res} 1.4003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9517271{col 26}{space 2} .0302891{col 37}{space 1}   31.42{col 46}{space 3}0.000{col 54}{space 4} .8921202{col 67}{space 3} 1.011334
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.970535{col 26}{space 2} .7352978{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-4.417549{col 67}{space 3}-1.523521
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       300
{txt}{hline 13}{c +}{hline 34}   F(1, 298)       = {res}   985.61
{txt}       Model {c |} {res} 1936.31092         1  1936.31092   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  585.44315       298  1.96457433   {txt}R-squared       ={res}    0.7678
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7671
{txt}       Total {c |} {res} 2521.75407       299   8.4339601   {txt}Root MSE        =   {res} 1.4016

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9524342{col 26}{space 2} .0303376{col 37}{space 1}   31.39{col 46}{space 3}0.000{col 54}{space 4} .8927311{col 67}{space 3} 1.012137
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.990642{col 26}{space 2}   .73665{col 37}{space 1}   -4.06{col 46}{space 3}0.000{col 54}{space 4}-4.440337{col 67}{space 3}-1.540947
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       299
{txt}{hline 13}{c +}{hline 34}   F(1, 297)       = {res}   983.46
{txt}       Model {c |} {res} 1936.46472         1  1936.46472   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 584.804128       297  1.96903747   {txt}R-squared       ={res}    0.7681
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7673
{txt}       Total {c |} {res} 2521.26885       298  8.46063373   {txt}Root MSE        =   {res} 1.4032

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9530226{col 26}{space 2} .0303896{col 37}{space 1}   31.36{col 46}{space 3}0.000{col 54}{space 4} .8932163{col 67}{space 3} 1.012829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.007513{col 26}{space 2} .7380807{col 37}{space 1}   -4.07{col 46}{space 3}0.000{col 54}{space 4}-4.460044{col 67}{space 3}-1.554983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       298
{txt}{hline 13}{c +}{hline 34}   F(1, 296)       = {res}   981.83
{txt}       Model {c |} {res} 1937.02144         1  1937.02144   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 583.971743       296  1.97287751   {txt}R-squared       ={res}    0.7684
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7676
{txt}       Total {c |} {res} 2520.99318       297  8.48819253   {txt}Root MSE        =   {res} 1.4046

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9536681{col 26}{space 2} .0304355{col 37}{space 1}   31.33{col 46}{space 3}0.000{col 54}{space 4} .8937708{col 67}{space 3} 1.013565
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.026154{col 26}{space 2} .7393572{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-4.481217{col 67}{space 3}-1.571091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       297
{txt}{hline 13}{c +}{hline 34}   F(1, 295)       = {res}   981.19
{txt}       Model {c |} {res} 1938.20421         1  1938.20421   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 582.731143       295  1.97535981   {txt}R-squared       ={res}    0.7688
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7681
{txt}       Total {c |} {res} 2520.93535       296  8.51667348   {txt}Root MSE        =   {res} 1.4055

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9544109{col 26}{space 2}  .030469{col 37}{space 1}   31.32{col 46}{space 3}0.000{col 54}{space 4} .8944467{col 67}{space 3} 1.014375
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.047833{col 26}{space 2} .7403278{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-4.504827{col 67}{space 3} -1.59084
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       296
{txt}{hline 13}{c +}{hline 34}   F(1, 294)       = {res}   982.68
{txt}       Model {c |} {res} 1940.35022         1  1940.35022   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 580.519425       294  1.97455587   {txt}R-squared       ={res}    0.7697
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7689
{txt}       Total {c |} {res} 2520.86964       295  8.54532082   {txt}Root MSE        =   {res} 1.4052

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9553122{col 26}{space 2} .0304747{col 37}{space 1}   31.35{col 46}{space 3}0.000{col 54}{space 4} .8953359{col 67}{space 3} 1.015288
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.074617{col 26}{space 2} .7406096{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-4.532186{col 67}{space 3}-1.617049
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       295
{txt}{hline 13}{c +}{hline 34}   F(1, 293)       = {res}   982.22
{txt}       Model {c |} {res} 1941.65242         1  1941.65242   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 579.204674       293  1.97680776   {txt}R-squared       ={res}    0.7702
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7695
{txt}       Total {c |} {res} 2520.85709       294  8.57434385   {txt}Root MSE        =   {res}  1.406

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9560228{col 26}{space 2} .0305046{col 37}{space 1}   31.34{col 46}{space 3}0.000{col 54}{space 4} .8959869{col 67}{space 3} 1.016059
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.095663{col 26}{space 2}  .741481{col 37}{space 1}   -4.17{col 46}{space 3}0.000{col 54}{space 4}-4.554967{col 67}{space 3}-1.636359
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       294
{txt}{hline 13}{c +}{hline 34}   F(1, 292)       = {res}   982.15
{txt}       Model {c |} {res} 1943.14412         1  1943.14412   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 577.712891       292   1.9784688   {txt}R-squared       ={res}    0.7708
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7700
{txt}       Total {c |} {res} 2520.85701       293  8.60360753   {txt}Root MSE        =   {res} 1.4066

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9567517{col 26}{space 2} .0305289{col 37}{space 1}   31.34{col 46}{space 3}0.000{col 54}{space 4} .8966671{col 67}{space 3} 1.016836
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.117423{col 26}{space 2} .7422157{col 37}{space 1}   -4.20{col 46}{space 3}0.000{col 54}{space 4}-4.578193{col 67}{space 3}-1.656652
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       293
{txt}{hline 13}{c +}{hline 34}   F(1, 291)       = {res}   985.49
{txt}       Model {c |} {res} 1945.84492         1  1945.84492   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 574.579052       291  1.97449846   {txt}R-squared       ={res}    0.7720
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7712
{txt}       Total {c |} {res} 2520.42397       292  8.63158895   {txt}Root MSE        =   {res} 1.4052

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .957721{col 26}{space 2}  .030508{col 37}{space 1}   31.39{col 46}{space 3}0.000{col 54}{space 4} .8976768{col 67}{space 3} 1.017765
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.146877{col 26}{space 2}  .741839{col 37}{space 1}   -4.24{col 46}{space 3}0.000{col 54}{space 4}-4.606927{col 67}{space 3}-1.686826
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       292
{txt}{hline 13}{c +}{hline 34}   F(1, 290)       = {res}   987.11
{txt}       Model {c |} {res} 1947.92418         1  1947.92418   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 572.277187       290  1.97336961   {txt}R-squared       ={res}    0.7729
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7721
{txt}       Total {c |} {res} 2520.20137       291  8.66048579   {txt}Root MSE        =   {res} 1.4048

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9585015{col 26}{space 2} .0305078{col 37}{space 1}   31.42{col 46}{space 3}0.000{col 54}{space 4} .8984567{col 67}{space 3} 1.018546
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.170928{col 26}{space 2} .7419612{col 37}{space 1}   -4.27{col 46}{space 3}0.000{col 54}{space 4} -4.63124{col 67}{space 3}-1.710616
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       291
{txt}{hline 13}{c +}{hline 34}   F(1, 289)       = {res}   989.93
{txt}       Model {c |} {res} 1950.34123         1  1950.34123   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 569.380901       289  1.97017613   {txt}R-squared       ={res}    0.7740
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7732
{txt}       Total {c |} {res} 2519.72213       290  8.68869699   {txt}Root MSE        =   {res} 1.4036

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9593468{col 26}{space 2} .0304911{col 37}{space 1}   31.46{col 46}{space 3}0.000{col 54}{space 4} .8993341{col 67}{space 3}  1.01936
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.197199{col 26}{space 2} .7416772{col 37}{space 1}   -4.31{col 46}{space 3}0.000{col 54}{space 4}-4.656973{col 67}{space 3}-1.737425
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       290
{txt}{hline 13}{c +}{hline 34}   F(1, 288)       = {res}   993.01
{txt}       Model {c |} {res} 1952.73146         1  1952.73146   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 566.343669       288  1.96647107   {txt}R-squared       ={res}    0.7752
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7744
{txt}       Total {c |} {res} 2519.07513       289  8.71652294   {txt}Root MSE        =   {res} 1.4023

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9601511{col 26}{space 2} .0304693{col 37}{space 1}   31.51{col 46}{space 3}0.000{col 54}{space 4} .9001804{col 67}{space 3} 1.020122
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.222642{col 26}{space 2} .7412622{col 37}{space 1}   -4.35{col 46}{space 3}0.000{col 54}{space 4}-4.681621{col 67}{space 3}-1.763664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       289
{txt}{hline 13}{c +}{hline 34}   F(1, 287)       = {res}   994.92
{txt}       Model {c |} {res} 1954.71759         1  1954.71759   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 563.868376       287  1.96469817   {txt}R-squared       ={res}    0.7761
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7753
{txt}       Total {c |} {res} 2518.58597       288  8.74509017   {txt}Root MSE        =   {res} 1.4017

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .960827{col 26}{space 2} .0304615{col 37}{space 1}   31.54{col 46}{space 3}0.000{col 54}{space 4} .9008708{col 67}{space 3} 1.020783
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.24442{col 26}{space 2}  .741182{col 37}{space 1}   -4.38{col 46}{space 3}0.000{col 54}{space 4}-4.703262{col 67}{space 3}-1.785579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       288
{txt}{hline 13}{c +}{hline 34}   F(1, 286)       = {res}   996.74
{txt}       Model {c |} {res} 1956.63526         1  1956.63526   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 561.425868       286  1.96302751   {txt}R-squared       ={res}    0.7770
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7763
{txt}       Total {c |} {res} 2518.06112       287  8.77373214   {txt}Root MSE        =   {res} 1.4011

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2}  .961471{col 26}{space 2}  .030454{col 37}{space 1}   31.57{col 46}{space 3}0.000{col 54}{space 4} .9015286{col 67}{space 3} 1.021413
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.26541{col 26}{space 2} .7411057{col 37}{space 1}   -4.41{col 46}{space 3}0.000{col 54}{space 4}-4.724123{col 67}{space 3}-1.806697
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       287
{txt}{hline 13}{c +}{hline 34}   F(1, 285)       = {res}   998.66
{txt}       Model {c |} {res} 1958.53153         1  1958.53153   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 558.932356       285  1.96116616   {txt}R-squared       ={res}    0.7780
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7772
{txt}       Total {c |} {res} 2517.46389       286  8.80232129   {txt}Root MSE        =   {res} 1.4004

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9620965{col 26}{space 2} .0304446{col 37}{space 1}   31.60{col 46}{space 3}0.000{col 54}{space 4} .9021717{col 67}{space 3} 1.022021
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.286031{col 26}{space 2}   .74098{col 37}{space 1}   -4.43{col 46}{space 3}0.000{col 54}{space 4}-4.744519{col 67}{space 3}-1.827543
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       286
{txt}{hline 13}{c +}{hline 34}   F(1, 284)       = {res}   999.65
{txt}       Model {c |} {res} 1960.24393         1  1960.24393   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 556.902843       284   1.9609255   {txt}R-squared       ={res}    0.7788
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7780
{txt}       Total {c |} {res} 2517.14677       285  8.83209393   {txt}Root MSE        =   {res} 1.4003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9626993{col 26}{space 2} .0304485{col 37}{space 1}   31.62{col 46}{space 3}0.000{col 54}{space 4} .9027659{col 67}{space 3} 1.022633
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.305584{col 26}{space 2} .7411838{col 37}{space 1}   -4.46{col 46}{space 3}0.000{col 54}{space 4}-4.764495{col 67}{space 3}-1.846674
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. coefplot regex_*, drop(_cons) nokey 
{res}
{com}. * Here we can conduct the same type of test with another country, Panama. 

. * We see lagged effects of GDP growth on FDI, where foreign investors don't start altering their FDI in response to GDP growth until what seems to be near the end of the 1980's or early 1990's. 

. 
. reg lnFDI lnGDP, r

{txt}Linear regression                               Number of obs     = {res}     1,174
                                                {txt}F(1, 1172)        =  {res}  5241.68
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7720
                                                {txt}Root MSE          =    {res} 1.2588

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9347046{col 26}{space 2} .0129104{col 37}{space 1}   72.40{col 46}{space 3}0.000{col 54}{space 4} .9093745{col 67}{space 3} .9600346
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.460132{col 26}{space 2} .3083354{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-3.065083{col 67}{space 3}-1.855181
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. est store model4

. * Here is the original simple linear regression, where a 1% increase in GDP is associated with a .9347% increase in FDI. 

. reg lnFDI lnGDP EXCHANGE POVERTY lnLIFE EASE, r

{txt}Linear regression                               Number of obs     = {res}        51
                                                {txt}F(5, 45)          =  {res}    99.25
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.8913
                                                {txt}Root MSE          =    {res} .58782

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} .9367251{col 26}{space 2} .0639666{col 37}{space 1}   14.64{col 46}{space 3}0.000{col 54}{space 4} .8078897{col 67}{space 3}  1.06556
{txt}{space 4}EXCHANGE {c |}{col 14}{res}{space 2}-.0000924{col 26}{space 2} .0000322{col 37}{space 1}   -2.87{col 46}{space 3}0.006{col 54}{space 4}-.0001573{col 67}{space 3}-.0000275
{txt}{space 5}POVERTY {c |}{col 14}{res}{space 2} .0524122{col 26}{space 2} .0144319{col 37}{space 1}    3.63{col 46}{space 3}0.001{col 54}{space 4}  .023345{col 67}{space 3} .0814795
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.289742{col 26}{space 2} 2.851997{col 37}{space 1}    2.56{col 46}{space 3}0.014{col 54}{space 4} 1.545525{col 67}{space 3} 13.03396
{txt}{space 8}EASE {c |}{col 14}{res}{space 2} .0342552{col 26}{space 2} .0187815{col 37}{space 1}    1.82{col 46}{space 3}0.075{col 54}{space 4}-.0035728{col 67}{space 3} .0720831
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -35.7446{col 26}{space 2} 11.58237{col 37}{space 1}   -3.09{col 46}{space 3}0.003{col 54}{space 4}-59.07268{col 67}{space 3}-12.41652
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. est store model5

. * Here is a multiple linear regression where I believe we have sufficiently controlled for multicollinearity. This is the same as our "model3" but without a tax condition. The only problem I see here is with the variable, POVERTY, having a statistically signficant positive effect on FDI. This is not the case, however, in the fixed-effects model, and I had to discard it as it was not statistically signficant in that case.

. xtreg lnFDI lnGDP lnLIFE lnEXCHANGE lnCRIME, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       525
{txt}Group variable: {res}countryname1{txt}{col 49}Number of groups{col 67}={col 69}{res}        27

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.6055{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.9111{col 63}{txt}avg{col 67}={col 69}{res}      19.4
{txt}     overall = {res}0.8419{col 63}{txt}max{col 67}={col 69}{res}        28

{txt}{col 49}F({res}4{txt},{res}494{txt}){col 67}={col 70}{res}   189.52
{txt}corr(u_i, Xb){col 16}= {res}-0.7709{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       lnFDI{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lnGDP {c |}{col 14}{res}{space 2} 1.124867{col 26}{space 2} .1165294{col 37}{space 1}    9.65{col 46}{space 3}0.000{col 54}{space 4} .8959128{col 67}{space 3} 1.353821
{txt}{space 6}lnLIFE {c |}{col 14}{res}{space 2} 7.530122{col 26}{space 2} 2.422705{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 2.770045{col 67}{space 3}  12.2902
{txt}{space 2}lnEXCHANGE {c |}{col 14}{res}{space 2} .1994533{col 26}{space 2} .0245831{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .1511529{col 67}{space 3} .2477537
{txt}{space 5}lnCRIME {c |}{col 14}{res}{space 2}-.1584598{col 26}{space 2} .0998131{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.3545703{col 67}{space 3} .0376508
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-38.78337{col 26}{space 2} 8.082949{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-54.66457{col 67}{space 3}-22.90218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0917049
     {txt}sigma_e {c |} {res} .66242227
         {txt}rho {c |} {res} .73089836{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}26{txt}, {res}494{txt}) = {res}15.39{col 62}{txt}Prob > F = {res}0.0000

{com}. est store model6

. * Here is the most precise I could make my estimators. To run a regression like this, we need variables with a every large sample size as we are comparing results across different years. In this model a 1% increase in GDP predicts a 1.12487% increase in FDI. A 1% increase in life expectancy predicts roughly a 7.53% increase in FDI. Interestingly, a 1% increase in LCU against USD (a 1% increase in depreciation) results in a .19945% increase in FDI. This makes more sense than in our OLS estimate, because, while foreign investors desire a strong stable currency, the depreciating currency results in a cheaper investment overall. Thus we can say, in our fixed-effects model, that a depreciating currency incentivizes Foreign Direct Investment into a country. Lastly, a 1% increase in the Homicide Rate (per 100,000 people) results in a -.15846% increase in FDI. This is not surprising, as greater in-country violence may cast doubt in the development potential of a country. 

. 
. outreg2 [model4 model5 model6] using tableF, word replace dec(5) label symbol(***,**,*,---) alpha(.01,0.05,0.1,.15)
{txt}{stata `"shellout using `"tableF.rtf"'"':tableF.rtf}
{browse `"/Users/patrickpoleshuk"' :dir}{com} : {txt}{stata `"seeout using "tableF.txt", label"':seeout}

{com}. 
. * As one final bit of analysis we can see, graphically, how our certain independent variables have progressed over the years within a given country. We can't use our entire data set of all countries, as there are too many observations to show a coherent graph trend. I will use Mexico, however, we could really use any country in the dataset. 

. 
. keep if countryname == "Mexico"
{txt}(1,652 observations deleted)

{com}. 
. graph twoway connected lnFDI lnGDP t
{res}
{com}. * asdoc graph twoway connected lnFDI lnGDP t

. * Here is the graphical representation of how the log values of FDI and GDP have progressed over the last 58 years. 

. graph twoway connected lnFDI lnGDP EXCHANGE POVERTY lnLIFE lnCRIME t
{res}
{com}. * asdoc graph twoway connected lnFDI lnGDP EXCHANGE POVERTY lnLIFE lnCRIME t

. * This is the graphical representation of how some of our valid control variables have changed over our observed period.  

. 
. * To conclude, after controlling for the possiblity of lagged effects, unobserved heterogeneity and aggregate trends, multicollinearity, and statistical signficance, we are only left with a handful of variables. What we can say, from our "model6", is that there is a definite positive relationship with a growing economy and foreign direct investment. Additionally, there is negative impact of violence, a positive effect of health, and a positive effect of a depreciating exchange rate on a country's foreign tangible investment. From these observations we can predict that for these Latin American countries, along with the United States, if health is not improved, if economic growth is not continuous, if local currencies are overvalued on the world market, and if homicide rates increase, foreign confidence in the growth prospects of these countries will decline. 

. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/patrickpoleshuk/FDI FINAL TIME .smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Nov 2020, 16:14:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}
